package javad.esmaeili.chibepazam;

import android.app.Activity;
import android.app.Application;
import android.content.Context;
import android.content.res.Resources;
import android.view.LayoutInflater;

import java.util.ArrayList;

/**
 * Created by Javad on 12/11/2016.
 */
public class G extends Application {

Resources res;

    public static ArrayList<ghaza> kol = new ArrayList<ghaza>();
    public static ArrayList<ghaza> notes = new ArrayList<ghaza>();

    public static Activity currentActivity;


    public static LayoutInflater inflater;

    public static int              low   = 0;
    public static int              high  = G.kol.size() - 1;
    public static int              rnd   = 0;


    public static Context context;

    @Override
    public void onCreate() {
        super.onCreate();

         res = getResources();

       // try {
        context= getApplicationContext();
        inflater = (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);


        ghaza abgosht= new ghaza();
        abgosht.title="آبگوشت";
        abgosht.desc= "" +
                "مواد لازم:\n" +
                "1-گوشت ماهیچه یا سردست با استخوان\t\t\t750گرم\n" +
                "2-نخود و لوبیای چیتی یا سفید\t\t\t\t150گرم یا به اندازه یک لیوان سر خالی\n" +
                "3- پیاز متوسط\t\t\t\t\t\t2تا3 عدد\t\t\t\n" +
                "4-سیب زمینی کوچک\t\t\t\t\t5تا6عدد\n" +
                "5-زردچوب و رب گوجه فرنگی\t\t\t\tکمی\n" +
                "6نمک و فلفل\t\t\t\t\t\t\tبه اندازه کافی\n" +
                "\n" +
                "طرز تهیه:\n" +
                "گوشت را تکه تکه می کنیم و می شونیم پیاز را خرد می کنی نخود و  لوبیا را میشونیم و همه این مواد را 5 تا 6 لیوان آب در ظرفی می ریزیم و می گذاریم با حرارت ملایم بپزد وقتی که گوشت نخود و لوبیا کاملا بخته شدند سیب زمینی ها را پوست میکنیم و به آنها اضافه میکنیم کمی زردچوبه و یک قشق رب گوجه فرنگی و به اندازه کافی نمک و فلفل می زنیم و میگذاریم سیب زمینی ها بپزد پس از پختن تمام موادباید در حدود 3 لیوان آب در ظرف مانده باشد در یگ زود پز با آب کمتر و در زمان کمتر آبگوشت بهتری به دست میاید\n";
        abgosht.id = R.mipmap.abgosht;
        abgosht.k.add("گوشت");
        abgosht.k.add("نخود");
        abgosht.k.add("لوبیا");
        abgosht.k.add("پیاز");
        abgosht.k.add("سیب زمینی");

        kol.add(abgosht);



        ghaza adaspolo= new ghaza();
        adaspolo.title="عدس پلو";
        adaspolo.desc= "مواد لازم:\n" +
                "1-برنج\t\t\t\t1کیلو\n" +
                "2--گوشت ماهیچه یا سردست گوسفند\t\tنیم کیلو\n" +
                "3-عدس\t\t\t\t\t\t750گرم\n" +
                "4-روغن\t\t\t\t\t\t200گرم\n" +
                "5-زعفران ساییده\t\t\t\t\t1قاشق چایخوری\n" +
                "6-پیاز\t\t\t\t\t\t\tیک عدد\n" +
                "طرز تهیه:\n" +
                "برنج را پس از چند بار شستن با  مقداری نمک خیس میکنیم گوشت را پس از شستن در ظرفی ریخته و یک عدد پیاز را پوست کنده و خرد میکنیم و داخل ظرف ریخته پس از افزودن سه لیوان آب میگذاریم خوب بپزد و در آخر مقداری نمک میزنیم\n" +
                "عدس را جداگانه میپزیم\n" +
                "آب نمک برنج را خالی کرده و در ظرفی مناسب با مقدار برنج با اندازه سه چهارم آن آب میریزیم و میگذاریم جوش بیاید برنج را داخل آبجوش رییخته و پس از خوردن چند جوش آنرا چک میکنیم تا نرم شده آنرا در آبکش ریخته مقداری آب نیمگرم  روی آن میدهیم\n" +
                "مقداری روغن مایع با نصف لیوان آب ته دیگ میریزیم و با کفگیر بترتیب برنج و سپس عدس در دیگ میریزیم دیگ را روی آتش گذاشته و آنرا دم میکنیم پس از دم کشیدن مقداری  آب زعفران روی آن میدهیم گوشت و برنج را در  دیسهای جدا ریخته و سرو میکنیم\n";
        adaspolo.id = R.mipmap.baghalaghato;
        adaspolo.k.add("برنج");
        adaspolo.k.add("گوشت");
        adaspolo.k.add("عدس");
        adaspolo.k.add("زعفران");
        adaspolo.k.add("پیاز");

        kol.add(adaspolo);

        ghaza ashreshte= new ghaza();
        ashreshte.title="آش رشته";
        ashreshte.desc = "مواد لازم:\n" +
                "1-رشته آماده شده مخصوص آش\t\t\t\t750گرم\n" +
                "2-سبزی آش\t\t\t\t\t\t\t2کیلو\n" +
                "3-نخود و  لوبیا و عدس(مجموعا به تساوی)\t\t750گرم\n" +
                "4-پیاز سرخ کرده\t\t\t\t\t\t4تا5 قاشق سوپ خوری\n" +
                "5-کشک ساییده غلیظ\t\t\t\t\t\t4تا5 قاشق\n" +
                "6-نمک و فلفل \t\t\t\t\t\tبه مقدار کافی\n" +
                "طرز تهیه:\n" +
                "حبوبات را که قبلا خیس کرده ایم با پیاز سرخ کرده (که ممکن است کمی زرد چوبه به آن زده باشیم) میگذاریم کاملا بپزد بعد سبزی را تمیز و خرد میکنیم و دا خل حبوبات پخته شده میریزیم و میگذاریم سبزیها بپزد سپس دو قاشق سوپ خوری آرد را در کمی آب سرد حل میکنیم داخل آش  میریزیم و مرتبا بهم میزنیم  رسته را در آش میریزیم و می گذاریم آهسته بپزد ولی شته نباید خرد شود بعد آش را ازروی آتش بر میداریم و با کشک ساده و پیاز سرخ کرده و نعناع داغ تزیین میکنیم ( آش رشته را با قیمه نیز میتوان صرف نمود)\n";
        ashreshte.id = R.mipmap.ashreshte;
        ashreshte.k.add("رشته");
        ashreshte.k.add("سبزی");
        ashreshte.k.add("نخود");
        ashreshte.k.add("لوبیا");
        ashreshte.k.add("عدس");
        ashreshte.k.add("پیاز");


        kol.add(ashreshte);


        ghaza fesenjon= new ghaza();
        fesenjon.title="فسنجان";
        fesenjon.desc= "مواد لازم فسنجان\n" +
                "•\tمغز گردو نیم کیلو\n" +
                "•\tمرغ به مقدار لازم\n" +
                "•\tپیاز دو عدد\n" +
                "•\tرب انار دو قاشق غذا خوری\n" +
                "•\tآب یک و نیم لیتر\n" +
                "طرز تهیه فسنجان\n" +
                "قبل از هرچیز باید گردوهارو چند باری چرخ کنیم چرا که هرچی بیشتر آسیاب بشن خورشتمون روغن بیشتری میندازه. پیازهارو رنده میکنیم و در ظرفی همراه گردو های آسیاب شده با مقدار کمی روغن تفت میدیم. بعد آب رو اضافه میکنیم و اجازه میدیم گردوها بپزه. مرغها رو هم میتونیم بپزیم و نیم ساعت آخر اضافه کنیم یا اینکه فقط تفت بدیم و یک ساعت آخر اضافه کنیم. گردوها که کمی غلیظ تر شدن میتونیم رب انار رو اضافه کنیم.اضافه کردن نمک هم فراموش نکنین.\n" +
                "مقدار رب انار و ترشی  فسنجان\n" +
                "این خورشت در نقاط مختلف کشور عزیزمون به شکلهای مختلف پخت میشه و بعضیها ترش و بعضیها شیرین و بعضیها ملس دوست دارن. رب انار انواع مختلفی داره که بعضیها خیلی ترش و بعضی ها ملس هستن و به نسبت این ترشی باید در خورشت اضافه بشن ولی دو قاشق سر صاف رب انار برای فسنجان ملس کافیه پس اگر ترش دوست دارید میتونید یکی دو قاشق بیشتر استفاده کنین و اگر شیرین دوست دارین میتونین یک قاشق رب اناز اضافه کنین و دو سه قاشق شکر.فوت کوزه گریش اینه که وقتی رب انار اضافه میشه و بلافاصله خورشت رو بچشین احساس میکنین ترشیش خیلی کمه و این در حالیه که اگر بیست دقیقه بعد همون رو بچشید متوجه میشید اصلا کم نبوده و ترش شده و این به خاطر اینه که ترشی رب انار خودش رو بعد از دقایقی نشون میده و همین باعث میشه بعضیها به اشتباه بیفتن و ترشیش رو زیاد کنن.\n";
        fesenjon.id = R.mipmap.fesenjoon;
        fesenjon.k.add("گردو");
        fesenjon.k.add( "مرغ");
        fesenjon.k.add("پیاز");
        fesenjon.k.add("رب انار");


        kol.add(fesenjon);




        ghaza ghyme= new ghaza();
        ghyme.title ="قیمه";
        ghyme.desc = "مواد لازم برای تهیه قیمه:\n" +
                "لپه یک لیوان\n" +
                "پیاز دو عدد\n" +
                "گوشت گوسفند به مقدار دلخواه\n" +
                "رب گوجه چهار قاشق غذاخوری سر صاف\n" +
                "آب و روغن و نمک و فلفل به مقدار لازم\n" +
                "طرز تهیه قیمه:\n" +
                "مثل همه غذاهایی که حبوبات دارن، قبل از هرچیزی لپه رو خیس میکنیم. پیاز هارو خرد میکنیم و با روغن و زردچوبه تفتش میدیم. کمی که آبش افتاد و طلایی شد گوشتهایی رو که خرد کردیم اضافه میکنیم و تفت میدیم. رنگ گوشتها هم که عوض شد کمی آب اضافه میکنیم و زمان میدیم تا گوشتها بپزه. مقدار دیگه ای از پیاز رو خرد میکنیم و در روغن تفت میدیم و لپه هایی که از دو سه ساعت قبل خیس وردن اضافه میکنیم تا تفت بخوره و بعد از کمی تفت آب اضافه میکنیم تا جدا بپزه.\n";
        ghyme.id = R.mipmap.ghayme;
        ghyme.k.add("لپه");
        ghyme.k.add("پیاز");
        ghyme.k.add("گوشت");

        kol.add(ghyme);



        ghaza jojekabab= new ghaza();
        jojekabab.title ="جوجه کباب";
        jojekabab.desc = "\n" +
                "جوجه ۷۵۰ گرم الی ۱ کیلو گرم\n" +
                "روغن زیتون ۲ قاشق غذاخوری\n" +
                "آبلیمو 2 قاشق سوپخوری\n" +
                "نمک و فلفل و زعفران حل شده (یا پاپریکا)\n" +
                "\n" +
                "\n" +
                "\n" +
                "طرز تهیه\n" +
                "بهترین وزن برای انتخاب جوجه کبابی از 750 گرم تا یک کیلو گرم است و این مقدار کباب برای استفاده دو نفر معمولا کافی است. جوجه را تمیز می کنیم و می شوئیم و خوب خشک می کنیم و آنرا بطریق زیر خرد می نمائیم .\n" +
                "بال های جوجه را به طوری که کمی از گوشت سینه به آن بماند از سینه جدا می کنیم و سینه را نیز از طرف استخوان جدا می نمائیم ( می توانیم سینه را با استخوان از وسط دو نیم کنیم ) . بعد رانها را از استخوان پشت جدا کرده و ماهیچه را هم از ران جدا می نمائیم. سپس به نسبت هر یک جوجه 2 قاشق روغن زیتون 2 قاشق سوپخوری آبلیمو و کمی نمک و فلفل و زعفران حل شده یا پایکارا مخلوط می نمائیم و جوجه را 4 تا 5 ساعت در این سس می خوابانیم.\n" +
                "بعد قطعات جوجه را سیخ می کشیم.به طوریکه ران ها و ماهیچه به یک سیخ و بال ها و گردن به سیخ دیگر و سینه  ها به سیخ سوم باشند.\n" +
                "ابتدا سیخ های ران وبال را روی آتش یکنواخت می گذاریم و کمی آتش را باد می زنیم و سیخ ها را پشت و رو می کنیم سپس از سس روغن زیتون و آب لیمو به آنها می دهیم و کمی که برشته شد سیخ های سینه را روی اتش قرار می دهیم( چون گوشت سینه لطیف تر است کمی دیرتر روی آتش گذاشته شود) وقتی قطعات جوجه طلائی و برشته شد.(و در طول مدت برشته شدن بایدمرتب از سس روغن زیتون و آبلیمو روی آن بدهیم) کباب ها را منظم به طوری که قطعات آن مشخص باشد در دیس می چینیم و اطراف آنرا با جعفری تزئین می کنیم بلافاصله سر میز می بریم \n";
        jojekabab.id = R.mipmap.joojehkabab;
        jojekabab.k.add("مرغ");


        kol.add(jojekabab);









        ghaza baghalapolo= new ghaza();
        baghalapolo.title ="باقلاپلو";
        baghalapolo.desc = "شوید باقلا پلو مجلسی با ماهیچه\n" +
                "مواد لازم برای ۴ نفر :\n" +
                " برنج : ۴ پیمانه   /  شوید پاک کرده:۳ پیمانه    /    پیاز : 2 عدد متوسط     \n" +
                "برگ بو : 1 عدد  /   زعفران دم کرده : نصف استکان /  باقلا لپه ای : ۳ پیمانه \n" +
                "ماهیچه گوسفند : ۵۰۰ گرم   /    رب گوجه فرنگی : 1 قاشق غذا خوری\n" +
                "روغن :به مقدار لازم    /    نمک، فلفل و زرد چوبه : به مقدار لازم \n" +
                "\n" +
                "طرز تهیه :\n" +
                " برنج را از شب قبل با مقداری آب و 2 قاشق غذا خوری نمک بخیسانید .\n" +
                "گوشت را با یک عدد پیاز و برگ بو و مقداری آب روی حرارت بالا قرار دهید تا آب بجوشد و کف روی گوشت را بگیرید و حرارت را روی متوسط تنظیم کنید و به مدت 2 ساعت زمان پخت برای گوشت در نظر بگیرید .\n" +
                "در قابلمه مناسبی تا نصف آب بریزید، بعد از جوشیدن آب یک قاشق غذا خوری نمک به آن اضافه کنید و باقلا پاک کرده را داخل آن بریزید تا ۲۰ دقیقه در آب بجوشد\n" +
                "کافی است.  بعد آب روی برنج را خالی کنید و برنج را داخل قابلمه بریزید و بسته به نوع برنج ، در زمان معین برنج و باقلا را با هم آبکش کنید .\n" +
                "ته قابلمه حدود ۲ قاشق غذاخوری روغن بریزید و ته دیگ مورد نظر را پهن کنید و یک لایه از مخلوط برنج و باقلا بریزید و پس شوید را به آرامی با موارد مخلوط کنید و اینکار را تا پایان نجام دهید ؛ همچنین میتوانید شوید را قبل از ریختن مخلوط برنج و باقلا داخل قابلمه ، داخل آبکش با مواد مخلوط کنید تا کاملا یکدست شوند .\n" +
                "نصف زعفران دم کرده را با یک استکان اب جوش و روغن روی برنج بریزید و بگذارید دم بکشد و حدود یک ساعت الی یک ساعت و نیم زمان برای دم کشیدن برنج در نظر بگیرید .\n" +
                "بعد از پختن گوشت، آن را از آب خارج کنید ، در انتهای طبخ گوشت باید به اندازه یک تا دو لیوان از آب گوشت باقی مانده باشد . آب گوشت را صاف کنید، یعنی پیاز و برگ بو را خارج کنید و دور بریزید و کمی نمک روی گوشت بپاشید و بگذارید این ترکیب کمی بماند تا مزه دار شود.\n" +
                "در تابه ای مقداری روغن گرم کنید، یک عدد پیاز باقیمانده را به صورت خلالی یکدست خرد کنید و همراه با کمی زردچوبه در روغن سرخ کنید تا طلایی شود سپس رب گوجه فرنگی را اضافه کنید و در روغن تفت دهید تا بوی خامی رب گرفته شود .\n" +
                "بعد گوشت پخته را که بهتر است به تکه های درشت خرد شده باشد داخل تابه بریزید و تمام سطح آنرا سرخ کنید ، باقیمانده زعفران را نیز داخل تابه بریزید .\n" +
                "نمک و ادویه آن را کنترل کنید و یک الی دو لیوان آب گوشت صاف شده را به مواد اضافه کنید و با حرارت متوسط و درب باز تا زمانی که آب گوشت کشیده شود روی حرارت قرار دهید.\n" +
                " وقتی برنج دم کشید و آب گوشت هم کشیده شد، مقداری روغن گرم کنید و روی پلو بریزید .  پلو را داخل قابلمه به آرامی با کمک کفگیر مخلوط کنید و داخل دیس بکشید و نیمی از برنج را کشیده و گوشت آماده را روی آن قرار دهید و بقیه پلو را روی گوشت بریزید .\n" +
                " \n" +
                " نکات مهم:\n" +
                "میتوانید از باقلای خشک نیز استفاده کنید که در اینصورت ۳-۴  ساعت قبل از استفاده باقلا را خیس کنید و بعد به صورت جداگانه بپزید .\n" +
                "برنج را نیز جدا آبکش کنید و بعد باقلا پخته و آبکش شده را با برنج آبکش شده مخلوط کنید و باقی مراحل را طی کنید .\n" +
                "در صورتی که از شوید خشک برای تهیه این پلو استفاده میکنید از اب و روغن بیشتری برای برنج استفاده کنید ولی لزومی به خیساندن شوید قبل از استفاده نیست .\n" +
                "بهتر است برای تهیه گوشتی که همراه با این پلو سرو میکنید از زودپز کمک بگیرید .\n" +
                "هنگام استفاده از زودپز در این مورد، گوشت بدون از دست دادن بافت و ظاهر خود در زمانی کوتاه تر آماده مصرف می شود و ظاهر پلو مجلسی تر خواهد شد .\n" +
                "بهتر است گوشتی که برای این منظور استفاده میکنید کمی چربی داشته باشد ولی هنگام سرو چربی را از آن جدا کنید .زمان طبخ کامل گوشت در زودپز به نوع زودپز و مقدار گوشت بستگی دارد\n" +
                "امیدواریم با تهیه این غذای خوشمزه، لذت کافی را برده و لحظات خوشی را در کنار خانواده سپری کنید.\n" +
                "نـوش جان\n";
        baghalapolo.id = R.mipmap.baghalaghato;
        baghalapolo.k.add("برنج");
        baghalapolo.k.add("شوید");
        baghalapolo.k.add("پیاز");

        baghalapolo.k.add("زعفران");
        baghalapolo.k.add("باقلا");
        baghalapolo.k.add("گوشت");

        kol.add(baghalapolo);







        ghaza chenisel= new ghaza();
        chenisel.title ="شنیسل بوقلمون"   ;
        chenisel.desc = "1- گوشت بوقلمون بدون استخوان 1000 گرم\n" +
                "2- سرکه یک چهارم لیوان\n" +
                "3- روغن، یک چهارم لیوان\n" +
                "4- ماست یک لیوان\n" +
                "5- سیر رنده شده یک حبه\n" +
                "6- پیاز متوسط خُرد شده یک عدد\n" +
                "طرز تهیه:\n" +
                "سرکه، روغن، پیاز، ماست و سیر رنده شده را با هم مخلوط کرده و گوشت را به تکه های کوچک خرد می کنیم. گوشت را به مدت حداقل 8 ساعت در این مواد خوابانده و درب ظرف حاوی مواد را میبندیم. پس از زمان لازم گوشت آماده کباب شده یا کوبیده شدن و ترکیب با آدر سوخاری و شنیسل شدن میباشد.\n";
        chenisel.id = R.mipmap.shensel;
        chenisel.k.add("بوقلمون");
      //  chenisel.k.add("سرکه");
        chenisel.k.add("ماست");
        chenisel.k.add("سیر");
        chenisel.k.add("پیاز");
        kol.add(chenisel);



        ghaza boghalamonshekampor= new ghaza();
        boghalamonshekampor.title ="بوقلمون شکم پر";
        boghalamonshekampor.desc ="مواد لازم :\n" +
                "بوقلمون 4 کیلو سیب 2 کیلو کره 250 گرم ماکارونی 300 گرم آرد 3 قاشق سوپخوری شکر 1 پیمانه گوجه فرنگی 5/0 کیلو هویج 4 عدد سبزی معطر یک دسته سیر 2-1 حبه آب لیمو به مقدار کافی نمک و فلفل به مقدار کافی برگ بو چند برگ اگر تازه نداشتید از عطاری ها بخرید.\n" +
                "طرز تهیه : بوقلمون را به دقت تمیز می کنیم و می شوئیم . داخل شکم آن کمی نمک و فلفل می پاشیم. بعد ماکارونی را در آب و نمک می جوشانیم تا کاملا نرم شود. آنگاه 7 عدد از سیب های یک اندازه و سالم را کنار می گذاریم و بقیه را پوست می کنیم. سپس یک سوم از کره را درظرفی می ریزیم و روی آتش می گذاریم. بعد از اینکه کره آب شد ، سیب های خرد شده را در کره کمی سرخ می کنیم و ماکارونی را به آن اضافه می کنیم و هم می زنیم. بعد از مدت کمی از روی آتش برمی داریم . شکر را درظرف کوچکی می ریزیم و روی آتش ملایم می گذاریم و مرتب بهم می زنیم تا طلائی شود. آنگاه نصف استکان آب جوش داخل شکر کارامل شده می ریزیم و می گذاریم چند جوش بزند تا ذرات شکر کارامل شده و کاملا حل شود. بعد نصف این شربت را با مخلوط فوق هم می زنیم و داخل شکم بوقلمون را با این مواد پر می کنیم و آن را می دوزیم . بقیه روغن را در ظرفی می ریزیم و روی آتش می گذاریم . داغ که شد، اطراف بوقلمون را در این روغن سرخ می کنیم و 3 لیوان آب می ریزیم . سبزی معطر ، چند حبه سیر ، 200 گرم هویج خرد شده و بقیه سیب ها را داخل ظرف بوقلمون می ریزیم . حرارت را ملایم می کنیم و می گذاریم بوقلمون بپزد . در صورتی که با این مقدار آب نپخت، یک لیوان آب دیگر اضافه می کنیم تا کاملاً بپزد. در اواخر طبخ سیب های درسته و گوجه برقانی را کنار بوقلمون می ریزیم تا آنها نیز بپزند، ولی له شوند . دسته سبزی معطر را از ظرف خارج می کنیم. بعد کمی نمک ، فلفل ، بقیه شربت کارامل و آب لیمو را داخل بوقلمون می ریزیم و می گذاریم چند جوش بزند. برای اینکه سس بوقلمون کمی غلیظ تر شود، یک قاشق سوپخوری سر خالی آرد را در 50 گرم کره کمی سرخ کرده و نصف لیوان آب به تدریج داخل آرد سرخ شده می ریزیم ومرتب بهم می زنیم. وقتی آرد کاملا صاف شد، این سس را داخل بوقلمون می ریزیم و می گذاریم چند جوش بزند . بعد سس را از صافی رد می کنیم و بوقلمون را در دیس می گذاریم و نخ زیر شکم آن را خارج می کنیم . سیب های درسته پخته و گوجه برقانی را دور بوقلمون می چینیم و فاصله های سیب ها را با برگ جعفری تزیین می کنیم وکمی از سس بوقلمون را که صاف کرده ایم روی بوقلمون می دهیم. \n";
        boghalamonshekampor.id = R.mipmap.boghalamonshekampor;
        boghalamonshekampor.k.add("بوقلمون");
        boghalamonshekampor.k.add("سیب");
        //boghalamonshekampor.k.add("کره");
        boghalamonshekampor.k.add("ماکارونی");
        boghalamonshekampor.k.add("سبزی");
       // boghalamonshekampor.k.add("آب لیمو");


        kol.add(boghalamonshekampor);




        ghaza boghalamon= new ghaza();
        boghalamon.title ="بوقلمون و خوراک سبزیجات همراه با فلفل";
        boghalamon.desc = "کلم پیچ و بوقلمون روش عالی پخت این غذا را خوشمزه تر و مغذی تر می\u200Cکند. گوشت بوقلمون نسبت به گوشت گاو چرخ کرده که معمولا در این غذا به کار می\u200Cرود از چربی کمتری برخوردار است و کلم پیچ ارزش غذایی آن را بسیار بالاتر می\u200Cبرد، مشروط به این که منبع غنی از ویتامین\u200Cهای کا و آ و ث و منگنز در آن وجود داشته باشد، که این ویتامین\u200Cها تنها بخشی از مواد مغذی یافت شده در کلم پیچ می\u200Cباشند.زمان پخت 30 دقیقه\n" +
                "\n" +
                "مواد اولیه:\n" +
                "1عدد پیاز متوسط ساتوری خرد شده \n" +
                "3عدد سیر متوسط خرد شده\n" +
                "یک پیمانه گوشت بوقلمون چرخ کرده \n" +
                "چهار مثقال فلفل سبز تو خالی شده \n" +
                "15 مثقال گوجه فرنگی پوست کنده \n" +
                "چهار فنجان و یک قاشق سوپ خوری آب مرغ \n" +
                "جهار فنجان کلم پیچ ریز خورد شده \n" +
                "15 مثقال لوبیای چشم بلبلی، با آب شسته شده و آب گرفته شده\n" +
                "2 قاشق سوپ خوری پونه تازه کوهی خرد شده\n" +
                "3 قاشق سوپ خوری سیلانترو تازه خرد شده\n" +
                "نمک و فلفل سیاه برای طعم آن \n" +
                "\n" +
                "روش تهیه:\n" +
                "1.سیرها و پیاز را خرد کرده و بگذارید به مدت حداقل 5 دقیقه بماند تا خواص آن به حد عالی خود برسند\n" +
                ".2یک قاشق سوپ خوری از آب مرغ را در یک ظرف متوسط گرم کنید. پیاز را داخل آن ریخته به مدت 5 دقیقه مرتب هم بزنید. سپس سیر و گوشت بوقلمون چرخ کرده را همراه با کمی\u200Cنمک و فلفل اضافه کنید، همین طور ادامه دهید و 5 دقیقه دیگر گوشت بوقلمون را داخل ظرفتان از هم دیگر جدا کنید\n" +
                "3.گوجه فرنگی، فلفل، آب گوشت بوقلمون را مخلوط کرده به آن اضافه کنید و بگذارید تا بجوشد، همراه با کلم پیچ خرد شده آن را هم بزنید، حرارت شعله را تا حد متوسط کم کنید و بگذارید تا ریز ریز به مدت 10 دقیقه دیگر بجوشد. \n" +
                "4.لوبیا را اضافه کرده، بگذارید تا 2 دقیقه دیگر آرام بجوشد، سپس سبزیجات دیگر، نمک و فلفل را به آن اضافه کنید. \n";
        boghalamon.id = R.mipmap.boghalamon;
        boghalamon.k.add("بوقلمون");
        boghalamon.k.add("سیر");
        boghalamon.k.add("پیاز");
        boghalamon.k.add("لوبیا");
       // boghalamon.k.add("پونه");
        kol.add(boghalamon);








        ghaza boghalamonsorkhsode= new ghaza();
        boghalamonsorkhsode.title ="بوقلمون سرخ شده";
        boghalamonsorkhsode.desc = "مواد لازم:\n" +
                "یک قطعه سینه بوقلمون \n" +
                "نیم کیلو پیاز ریز سفید پخته شده \n" +
                "نیم کیلو کلم بروکسل پخته شده \n" +
                "نیم کیلو سیب زمینی ریز پخته \n" +
                "250گرم سوسیس \n" +
                "5تا6 ورق کالباس \n" +
                "200گرم ن کره \n" +
                "به مقدار کافی نمک وفلفل \n" +
                "\n" +
                "بوقلمون را بدقت تمیز میکنیم وصد گرم از کره رادرقابلمه ای می ریزیم وروی آتش میگذاریم داغ که شد دوطرف بوقلمون رادرروغن سرخ می کنیم تا کاملاطلائی شود یک دسته کوچک جعفری ویک دوعدد هویج خرد کرده ویک عدد پیاز خرد شده کنار بوقلمون میگذارم وکمی نمک وفلفل به بوقلمون می زنیم ویک لیوان آب بآن اضافه می کنیم وحرارت را ملا یم می نمائیم تا بوقلمون کاملا بپزد درصورتیکه آب بوقلمون تمام شده باشد ولی هنوز نپخته باشد کمی آب اضافه می کنیم . باید توجه داشت وقتی بوقلمون پخته شده باشد دوتا سه قاشق بیشتر آب نداشته باشد بعد بوقلمون را میگذاریم کاملاسرد شود وبا کارد تیزی آنرا ورقه ورقه نازک میبریم بعد دیس مطابق شکل با سبزی های پخته شده وسوسیس می چینیم آنگاه سس بوقلمون راصاف وگرم می کنیم وروی بوقلمون میدهیم ممکن است دوطرف دیس را با پوره سیب زمینی درقیف تزیین کنیم وورقه های کالباس را بالا ی پوره ها یک گوشه دیس قرار می دهیم\n";
        boghalamonsorkhsode.id = R.mipmap.boghalamonsorkhshode;
        boghalamonsorkhsode.k.add("بوقلمون");
        boghalamonsorkhsode.k.add("کلم");
        boghalamonsorkhsode.k.add("پیاز");
        boghalamonsorkhsode.k.add("سیب زمینی");
        boghalamonsorkhsode.k.add("سوسیس");
        boghalamonsorkhsode.k.add("کالباس");
       // boghalamonsorkhsode.k.add("کره");
        kol.add(boghalamonsorkhsode);





        ghaza makaranibagoshtboghalamon= new ghaza();
        makaranibagoshtboghalamon.title ="ماکارونی با گوشت بوقلمون";
        makaranibagoshtboghalamon.desc ="گوشت چرخ کرده بوقلمون که از ترکیب ران و سینه بوقلمون تشکیل میشود،میتوان به عنوان جایگزین گوشت چرخ کرده گوسفند و گوساله در غذاهایی مانند ماکارونی ،لوبیا پلو و کباب تابه ای استفاده کرد.گوشت چرخ کرده را با پیاز داغ ،نمک و فلفل و زردچوبه تفت میدهیم،تاگوشت طلایی رنگ شود.سپس یک حبه سیر خرد شده را به همراه کمی گرد لیمو و سه تا چهار قاشق رب گوجه فرنگی اضافه کرده تفت میدهیم و با کمی آب میگذاریم پانزده دقیقه بجوشدو سپس آنرا به ماکارونی آبکش شده اضافه میکنیم";
        makaranibagoshtboghalamon.id = R.mipmap.makaronibaboghaamon;
        makaranibagoshtboghalamon.k.add("بوقلمون");
       // makaranibagoshtboghalamon.k.add("زدچوبه");
        makaranibagoshtboghalamon.k.add("پیاز");
        makaranibagoshtboghalamon.k.add("سیر");
        makaranibagoshtboghalamon.k.add("لیمو");
        kol.add(makaranibagoshtboghalamon);




        ghaza gharchbaboghalamon= new ghaza();
        gharchbaboghalamon.title ="خورش قارچ با بوقلمون";
        gharchbaboghalamon.desc = "سینه بوقلمون را به تکه های کوچک تقسیم میکنیم و آنرا در پیاز داغ،نمک ،فلفل و زردچوبه تفت میدهیم تا طلایی شود.سپس لوبیا و قارچ خردشده را به آن اضافه میکنیم وتفت میدهیم تا زمانیکه آب قارچ تمام شود،حالا هویج را به آن اضافه کرده و با مقداری آب میگذاریم بپزد تا خورش جا بیفتد";
        gharchbaboghalamon.id = R.mipmap.gharch;
        gharchbaboghalamon.k.add("بوقلمون");
        gharchbaboghalamon.k.add("پیاز");
        //gharchbaboghalamon.k.add("زردچوبه");
        gharchbaboghalamon.k.add("قارچ");
        //gharchbaboghalamon.k.add("هویج");
        kol.add(gharchbaboghalamon);




        ghaza baghalipolobagoshtboghalamon= new ghaza();
        baghalipolobagoshtboghalamon.title ="باقالی پلو با گوشت بوقلمون";
        baghalipolobagoshtboghalamon.desc ="ابتدا ران(ساق) بوقلمون را در پیاز داغ و ادویه تفت داده در ادامه با اضافه کردن مقداری سیرتفت دادن را به اتمام میرسانیم.ساق بوقلمون تفت داده شده را در قابلمه ای که حاوی آب است ،به مدت یک ساعت میپزیم .اگر از زودپز استفاده میکنیدسطح آب باید پایینتر از ساقها قرار بگیرد.در طول طبخ میتوان از طعم دهنده هایی مانند فلفل دلمه ای ،هویج،برگ بو،ساقه کرفس و ....استفاده کرد.وقتی که آب گوشت غلیظ شددارچین و زعفران ساییده شده را به آن اضافه میکنیم.خوراک آماده شده را هم میتوان با شوید باقالا پلو دم کرد و هم میتوان در ظرفی جدا سروکرد.";
        baghalipolobagoshtboghalamon.id = R.mipmap.baghalipolo;
        baghalipolobagoshtboghalamon.k.add("بوقلمون");
        baghalipolobagoshtboghalamon.k.add("پیاز");
        baghalipolobagoshtboghalamon.k.add("سیر");
        baghalipolobagoshtboghalamon.k.add("زعفران");

        kol.add(baghalipolobagoshtboghalamon);









        ghaza ghormesabzi= new ghaza();
        ghormesabzi.title ="قورمه سبزی";
        ghormesabzi.desc = "مواد لازم:\n" +
                "•\t سبزی قورمه\u200Cسبزی (تره، جعفری، گشنیز، اسفناج و شنبلیله) سرخ شده: 200 گرم\n" +
                "•\t گوشت گوسفندی: 350 گرم\n" +
                "•\t لوبیا قرمز: 200 گرم\n" +
                "•\t لیموامانی: 3 عدد\n" +
                "•\t چاشنی رب نارنج: یک قاشق مرباخوری\n" +
                "•\t نمک و زردچوبه: به میزان لازم\n" +
                "•\t پیاز متوسط: یک عدد\n" +
                "•\t روغن: به میزان لازم\n" +
                "\n" +
                "روش تهیه:\n" +
                "\n" +
                "ابتدا پیاز را با روغن سرخ می\u200Cکنیم تا پیاز طلایی شد، گوشت را به آن اضافه میکنیم تا سرخ شود. سپس زردچوبه و سبزی\u200Cهای که از قبل سرخ شده است را به مواد اضافه میکنیم، بعد لوبیا و لیمو امانی و حدود یک\u200Cپنجم لیتر آب به مواد اضافه می\u200Cکنیم، حرارت را کم کرده تا مواد3 ساعت پخته شود. حدود 15 دقیقه آخر، چاشنی (رب نارنج) را به مواد اضافه می\u200Cکنیم.\n" +
                "\n" +
                "\n" +
                "نکات ویژه:\n" +
                "\n" +
                "لیمو «امانی» همان لیموترش معمول خشک\u200Cشده است. اما شهرت آن به اسم لیمو «امانی» به این دلیل است که شهر «امان» پایتخت کشور اردن معروف\u200Cترین نوع لیمو را دارد. کشورهای اردن، لبنان و فلسطین بین کشورهای مختلف از نظر محصولات مرکباتی، بسیار بنام هستند و طعم و عطر این محصول مثل زیره کرمان خودمان است. اما در ایران به اشتباه و به عرف این لیمو را «لیموی عمانی» می\u200Cنامند. لازم به ذکر است کشور «عمان» فاقد هر نوع محصولات مرکباتی معروف بوده و زیتون این کشور بسیار مشهور است.\n";
        ghormesabzi.id = R.mipmap.ghormesabzi;
        ghormesabzi.k.add("سبزی");
        ghormesabzi.k.add("گوشت");
        ghormesabzi.k.add("لوبیا");
        ghormesabzi.k.add("لیمو");
        ghormesabzi.k.add("نارنج");
        ghormesabzi.k.add("پیاز");

        kol.add(ghormesabzi);





        ghaza kotletbagosht= new ghaza();
        kotletbagosht.title ="کتلت گوشت";
        kotletbagosht.desc ="مواد اولیه:\n" +
                "•\tروغن سرخ کردنی به مقدار لازم\n" +
                "•\tگوشت چرخ کرده 250 گرم\n" +
                "•\tگوجه فرنگی 5 عدد\n" +
                "•\tسیب زمینی 250 گرم\n" +
                "•\tپیاز رنده شده 2 عدد بزرگ\n" +
                "•\tسیر رنده شده 3 حبه\n" +
                "•\tتخم مرغ 1 عدد\n" +
                "•\tآرد نخودچی سه قاشق غذاخوری\n" +
                "•\tجعفری خرد شده سه قاشق غذاخوری\n" +
                "•\tنمک و فلفل سیاه و زردچوبه به میزان لازم\n" +
                "•\tپودر زیره سبز یک قاشق غذاخوری\n" +
                "طرز تهیه:\n" +
                "\n" +
                "ابتدا پیاز و سیب زمینی و سیر را رنده کرده و بعد گوشت چرخ کرده و تخم مرغ و ادویه را به مواد اضافه می کنیم و حدود 5 الی 10 دقیقه مواد را خوب ورز می دهیم جعفری و پودر زیره را هم اضافه می کنیم، در مرحله آخر آرد نخود چی را به مواد اضافه می کنیم و مواد را ورز می دهیم، تابه را روی حرارت می گذاریم و داخل آن روغن میریزیم وقتی که روغن داغ شد حرارت را کم می کنیم و از مواد به اندازه دو قاشق غذاخوری کف دست ریخته و به شکل بیضی درآورده و در روغن سرخ می کنیم یک طرف که طلایی شد طرف بعد را هم سرخ می کنیم. در آخر هم گوجه فرنگی را حلقه حلقه کرده و در روغن سرخ می کنیم و همراه کتلت سرو می کنیم.\n";
        kotletbagosht.id = R.mipmap.kotletgosht;
        kotletbagosht.k.add("گوشت");
        kotletbagosht.k.add("پیاز");
       // kotletbagosht.k.add("زردچوبه");
        kotletbagosht.k.add("قارچ");
       // kotletbagosht.k.add("هویج");
        kol.add(kotletbagosht);



        ghaza ghaliye= new ghaza();
        ghaliye.title ="قلیه ماهی";
        ghaliye.desc="مواد لازم : \n" +
                "یک کیلو (شوریده- سنگسر- هامور) ماهی پوست گرفته و پاک شده\n" +
                "یک بوته سیر\n" +
                "300 گرم سبزی (گشنیز و شنبلیله)\n" +
                "یک بسته تمرهندی\n" +
                "یک عدد متوسط پیاز\n" +
                "به قدر دلخواه زردچوبه و نمک\n" +
                "یک قاشق چایخوری پودر فلفل قرمز\n" +
                "یک قاشق غذا خوری و یا یک فنجان آب گوجه فرنگی رب گوجه فرنگی\n" +
                " \n" +
                "روش تهیه :\n" +
                "ماهی را به اندازه ی تکه های 4×4 سانتی متر خُرد کرده و می شوییم . ماهی که برای قلیه ماهی استفاده می کنیم بایستی بدون استخوان باشد. به همین دلیل ماهی های : شوریده- سنگسر- هامور و حلوا سیاه برای تهیه این غذا مناسب هستند. سبزی این خورشت شامل شنبلیله و گشنیز، هر کدام یه میزان 150 گرم می باشد. پیاز خرد شده را با 3 قاشق سوپخوری روغن، کمی تفت می دهیم. سپس سیر و شنبلیله و گشنیز خرد شده، را با آن کمی تفت می دهیم. ماهی را با کمی زردچوبه و نمک، به همراه سبزی ها تفت می دهیم. بعد شیره تمرهندی و رب گوجه فرنگی را اضافه کرده و قلیه ماهی را با شعله ملایم به مدت 30 دقیقه می پزیم. غذا آماده ی سرو است.\n" +
                "\n" +
                "نکات تغذیه ای :\n" +
                "این خورشت ، یک غذای محلی خوشمزه و برای نواحی خوزستان است. به علت دارا بودن سبزی و سیر، غذای خوش طعم و خوش رنگی است. ترشی این غذا بوسیله تمرهندی تأمین می شود.\n" +
                "همچنین در تهیه این خورش به جای گوشت قرمز از ماهی استفاده شده است که نه تنها ضرری ندارد ، بلکه دارای فواید بسیاری است. کسانی که دارای چربی خون بالا و یا ناراحتی قلبی هستند، می توانند از این خورشت استفاده کنند ولی به شرط آنکه مواد با مقدار کمی روغن و برای مدت کوتاهی تفت داده شوند.\n" +
                "امیدواریم با تهیه این غذای خوشمزه، لذت کافی را برده و لحظات خوشی را در کنار خانواده سپری کنید.\n" +
                "\n";
        ghaliye.id = R.mipmap.ghaliemahi;
        ghaliye.k.add("ماهی");
        ghaliye.k.add("سیر");
        ghaliye.k.add("تمر");
        ghaliye.k.add("پیاز");


        kol.add(ghaliye);




        ghaza mahighezelala= new ghaza();
        mahighezelala.title ="ماهی قزل آلا";
        mahighezelala.desc="مواد لازم:\n" +
                "\n" +
                "ماهی قزل آلا:1 عدد\n" +
                "گوجه فرنگی حلقه شده:2 عدد\n" +
                "لیمو ترش تازه حلقه شده:1 عدد\n" +
                "نمک:به مقدار لازم\n" +
                "پودر زنجبیل:به مقدار لازم\n" +
                "سیر و شوید تازه:به مقدار لازم\n" +
                "\n" +
                "\n" +
                "طرزتهيه:\n" +
                "بهترين روش طبخ براي ماهي قزل آلا به اين نحو است كه ماهي را شسته و بعد از تميزكردن, داخل شكم آن را كمي سيرتازه بماليد و مقداري پودر زنجبيل و نمك به آن بزنيد و مقداري شويد تازه درون شكم آن قرار داده و بگذاريد يك ساعت در يخچال بماند. (می توانید مقدار کمی آبلیمو نیز به آن بزنید)\n" +
                "بعد از يك ساعت ماهي را از يخچال بيرون بياوريد و با استفاده از برس آشپزخانه كمي روغن( حدود نصف قاشق غذاخوري روغن زيتون) روي آن بماليد. روي كاغذ آلومينيوم چند حلقه گوجه فرنگي بگذاريد و بعد چند حلقه ليموترش و بعد ماهي را روي گوجه و ليموترش قرار دهيد و بعد دوباره ليموترش و گوجه فرنگي روي ماهي بچينيد و سپس كاغذ را محكم ببنديد و در فر روي ميله هاي وسط با درجه حرارت 250- 220 درجه سانتيگراد بگذاريد. در مدت نيم ساعت تا 45 دقيقه ماهي آماده مي شود و عصاره گوجه و ليموترش به خورد ماهي مي رود.\n";
        mahighezelala.id = R.mipmap.mahighezelala;
        mahighezelala.k.add("ماهی");
        mahighezelala.k.add("شوید");
        mahighezelala.k.add("سیر");
        mahighezelala.k.add("لیمو");

        kol.add(mahighezelala);





        ghaza morghberyan= new ghaza();
        morghberyan.title ="مرغ بریان شکم پر";
        morghberyan.desc = "مواد لازم:\n" +
                "مرغ درسته با پوست: 1 عدد\n" +
                "زعفران\n" +
                "کره\n" +
                "نمک و فلفل و کمی زردچوبه \n" +
                "سیر و پیاز\n" +
                "هویج\n" +
                "آلو بخارا\n" +
                "برای توی شکمش:\n" +
                "گردو: 3 قاشق خرد شده\n" +
                "رب انار 1 یا 2 قاشق غ خ\n" +
                "سبزی معطر(ترخون و تره و جعفری و پیازچه )4 قاشق غ خ\n" +
                "ذرت:2 قاشق غ خ\n" +
                "کمی روغن یا کره برای سرخ کردن مواد\n" +
                "آلوچه یا آلو بخارا:4 یا 5 عدد\n" +
                "نمک و فلفل و زردچوبه\n" +
                "پیاز:1 عدد کوچیک\n" +
                "میتونید کشمش یا زرشک هم استفاده کنید\n" +
                "اول مرغ رو تو پیاز و سیر نمک و فلفل و زردچوبه 2 ساعت بخوابونید\n" +
                "بعد زعفران رو به همه جاش خوب بمالید تا حسابی زعفرانی بشه\n" +
                "برای مواد توشکمش: \n" +
                "پیاز رو ریز کرده و تفت بدید و سبزی و بعد گردو وبعد ذرت و به ترتیب آلو و نمک و فلفل و زردچوبه و رب انار رو اضافه\n" +
                "و بذارید 2 دقیقه خوب تفت بخوره\n" +
                " \n" +
                "این مواد رو تو شکم مرغ ریخته و اونو با نخ مشکی بدوزید\n" +
                "پاهای مرغ رو هم بهم ببندید و روی سینه اش با چاقو چند تا برش کوچیک بزندید که خوب مغز پخت بشه\n" +
                "حالا توظرف پیرکس یه فویل بندازید(میتونید هم نندازید)و یه پیاز ورقه شده توش بچینید و هویج و الو هم توش بچینید و مرغ رو \n" +
                "داخلش قرار بدید و تو فری که با دمای 180 درجه گرم کردید قرار بدید به مدت 2 تا 3 ساعت(بسته به درشتی مرغ و دمای فر)\n" +
                "و هر 20 تا 30 دقیقه با برس روش کره بمالید تاخشک نشه\n" +
                "و وقتی مرغ پخت گریل رو شن کنید تا روی مرغ هم کمی طلایی بشه \n" +
                "\n";
        morghberyan.id = R.mipmap.morghberyanshekampor;
        morghberyan.k.add("مرغ");
       // morghberyan.k.add("کره");
        morghberyan.k.add("سیر");
        morghberyan.k.add("پیاز");
       // morghberyan.k.add("هویج");
        morghberyan.k.add("آلو");
        morghberyan.k.add("گردو");
        morghberyan.k.add("ذرت");
        morghberyan.k.add("آلوچه");
        kol.add(morghberyan);




        ghaza aloviye= new ghaza();
        aloviye.title ="اولویه";
        aloviye.desc = "مواد لازم:\n" +
                "مرغ    یک نصفه(در حدود 750گرم)\n" +
                "تخم مرغ سفت شده    4عدد\n" +
                "نخود سبز     یک پیمانه\n" +
                "هویچ متوسط    یک تا دو عدد\n" +
                "خیارشور    150گرم\n" +
                "سیب زمینی اسلامبولی    یک کیلو\n" +
                "سس مایونز     2 و نیم پیمانه \n" +
                "\n" +
                "طرز تهیه:\n" +
                "\n" +
                "مرغ را با یک عدد پیاز خرد شده و چند برگ جعفری و یکی دو عدد هویج و کمی نمک می پزیم بطوریکه بعد از پختن یکی دو قاشق بیشتر آب نداشته باشد.نخود و سیب زمینی را جداگانه می پزیم(می توان از کنسرو نخود سبز هم استفاده کرد)،مرغ را پس از بیرون کشیدن استخوانهایش،خرد می کنیم. بعد سیب زمینی را با گوشت کوب له می کنیم و تخم مرغ سفت شده را رنده می کنیم و با خیارشور خرد شده و نخود سبز و سس مایونز و دو تا سه قاشق آبلیمو به مرغ اضافه می کنیم. سالاد آماده شده را در دیس می ریزیم و روی آن را با قاشق صاف می کنیم و سس مایونز را روی آن می مالیم و با دانه های زیتون و حلقه های خیارشور روی آن را تزئین می کنیم.\n";
        aloviye.id = R.mipmap.oloviye;
        aloviye.k.add("مرغ");
        aloviye.k.add("تخم مرغ");
        aloviye.k.add("نخود");
       // aloviye.k.add("هویج");
        aloviye.k.add("خیارشور");
        aloviye.k.add("سیب زمینی");

        kol.add(aloviye);






        ghaza kokosabzi= new ghaza();
        kokosabzi.title ="کوکو سبزی";
        kokosabzi.desc= "مواد لازم : \n" +
                "سبزی کوکو : نیم کیلو \n" +
                "تخم مرغ : سه عدد \n" +
                "گردو ریز خرد شده : یک لیوان \n" +
                "نمک و فلفل : به میزان لازم \n" +
                "روغن : برای سرخ کردن \n" +
                "طرز تهیه : \n" +
                "سبزی کوکو را خوب خرد میکنیم. تخم مرغ ، گردو ، نمک و فلفل را به سبزی اضافه میکنیم با قاشق خوب هم میزنیم. ماهی تابه را روی شعله قرار میدهیم خوب که داغ شد روغن را در آن ریخته و مواد کوکو را داخل ماهی تابه میریزیم . به مدت یک الی دو دقیقه شعله را زیاد میکنیم بعد بدون اینکه در ماهی تابه را بگذاریم شعله را کم کرده تا یکطرف آن خوب سرخ شود. بعد از اینکه یکطرف آن سرخ شد کوکو را با قاشق چوبی به چهار قسمت مساوی تقسیم میکنیم و به روی دیگر بر میگردانیم تا طرف دیگر هم سرخ شود و بعد در ماهی تابه را میگذاریم بعد از ۱۵ الی ۲۰ دقیقه کوکوی شما خوب سرخ شده و آماده سرو میباشد. \n" +
                "\n";
        kokosabzi.id = R.mipmap.kokosabzi;
        kokosabzi.k.add("سبزی");
        kokosabzi.k.add("تخم مرغ");
        kokosabzi.k.add("گردو");


        kol.add(kokosabzi);




        ghaza polomeygo= new ghaza();
        polomeygo.title ="پلو میگو";
        polomeygo.desc="مواد لازم:\n" +
                "1.\tمیگو ۳۰۰ گرم ۲۰ عدد\n" +
                "2.\tبرنج ۲ پیمانه\n" +
                "3.\tپیاز ۱ عدد متوسط\n" +
                "4.\tسبزی 150 گرم (گشنیز و شنبلیله)\n" +
                "5.\tزردچوبه ۱ قاشق چایخوری سر پُر\n" +
                "6.\tفلفل قرمز یک دوم قاشق چایخوری\n" +
                "طرز تهیه:\n" +
                "نکته: هنگامیکه میگو به همراه برنج یا بطور مخلوط استفاده می\u200Cشود، نیازی به استفاده از میگوهای بزرگ نیست چون هر چه تعداد میگو بیشتر باشد غذا خوشمزه تر است؛ بنابراین بسته\u200Cهایی را انتخاب کنید که میگوها ریزتر ولی تعدادش بیشتر باشد.\n" +
                "سبزی این غذا همان سبزی قلیه ماهی ست که شامل گشنیز و شنبلیله است. همیشه مقدار شنبلیله را کمتر بگیرید چون زیادیش غذا را تلخ می\u200Cکند. اصولاً به ازای هر ۳۰ شاخه گشنیز، ۵ شاخه شنبلیله کافیست.\n" +
                "پیاز را خلالی خرد کنید و با روغن تفت بدهید تا پیاز تغییر رنگ بدهد. بعد میگوهای پاک کرده را اضافه کنید و نمک و فلفل و زردچوبه را هم اضافه کنید و بعد از ۳ دقیقه سبزی را اضافه کنید و کمی تفت بدهید.\n" +
                "خود بوشهری\u200Cها میگو را جدا تفت میدند و سبزی را جدا ولی با دستور بالا میگو بیشتر عطر گشنیز را به خودش می\u200Cگیرد و خوش طعم تر می\u200Cشود فقط دقت کنید در کل بیشتر از ۵-۶ دقیقه تفتش ندید چون میگو خیلی زود می\u200Cپزد و نباید حالت ترد و آبداریش رو از دست بده و خشک بشود. از این جا به بعد طرز عمل مثل لوبیا پلو یا هر پلوی مخلوط دیگری است.\n" +
                "برنج را آبکش کنید و کف قابلمه روغن بریزید و بعد از اینکه روغن داغ شد، ابتدا یک لایه برنج، سپس یه لایه مایه میگو را بریزید و برنج را دم کنید. مایه میگو کمی سفت تر از مایه بقیه پلو مخلوطهاست ولی بعد از اینکه برنج پخت، موقع کشیدن همه مواد مخلوط میشه و می\u200Cتوانید زمان دم کردن برنج کمی زعفران هم به برنج بزنید که برنج خوشرنگتر بشود.\n" +
                "\n";
        polomeygo.id = R.mipmap.polomeygo;
        polomeygo.k.add("میگو");

        polomeygo.k.add("پیاز");
        polomeygo.k.add("سبزی");
       // polomeygo.k.add("زردچوبه");
        kol.add(polomeygo);






        ghaza poloaloasfenaj= new ghaza();
        poloaloasfenaj.title ="پلو آلو اسفناج";
        poloaloasfenaj.desc="مواد اولیه :\n" +
                "*گوشت گوساله پخته شده            ۵۰۰ گرم\n" +
                "* اسفناج                          ۵۰۰ گرم\n" +
                "* آلو سیاه                       ۱۰۰ گرم\n" +
                "* برنج                                      سه پیمانه\n" +
                "* پیاز بزرگ                          دو عدد\n" +
                "*زعفران دم\u200Cکرده                 یک قاشق غذاخوری\n" +
                "* نمک، فلفل و روغن                       به میزان لازم\n" +
                "طرز تهیه:\n" +
                "پیازها را سرخ کرده و به گوشت ریش شده اضافه می\u200Cکنیم. اسفناج\u200C را نیز پس از شستن درون قابلمه می\u200Cریزیم تا نرم شوند، (نیاز به پختن ندارند) مخلوط گوشت و پیاز را همراه اسفناج، نمک، فلفل و آلوهایی که از قبل خیسانده بودیم، مخلوط کرده و درون روغن تفت می\u200Cدهیم. برنج را آبکش کرده و مواد آماده شده را لابه\u200Cلای آن ریخته و می\u200Cگذاریم تا پلو دم بکشد. مقداری از برنج را زعفرانی کرده و لابه\u200Cلای برنج اضافه می\u200Cکنیم.\n";
        poloaloasfenaj.id = R.mipmap.alooesfenadje;
        poloaloasfenaj.k.add("گوشت");
        poloaloasfenaj.k.add("اسفناج");
        poloaloasfenaj.k.add("آلوسیاه");
        poloaloasfenaj.k.add("پیاز");
        poloaloasfenaj.k.add("زعفران");
        kol.add(poloaloasfenaj);




        ghaza poloalbalo= new ghaza();
        poloalbalo.title ="آلبالو پلو";
        poloalbalo.desc="مواد لازم:\n" +
                "برنج یک کیلوشکر: نیم کیلو\n" +
                "آلبالو: یک کیلوروغن: 300 گرم\n" +
                "گوشت چرخ کرده: 500 گرمزعفران سائیده: به مقدار لازم\n" +
                "طرز تهیه نوع اول:\n" +
                "برنج را آبکش کنید و کنار بگذارید. آلبالوی تازه را شسته دُم و هسته آن را بگیرید و آن را در آب بسیار کم قدری بپزید و رویش شکر بریزید. از گوشت چرخ کرده کوفته ریزه درست کنید و آن را در روغن سرخ کرده کنار بگذارید. ته دیگ قدری روغن بریزید و روی آن قدری برنج و سپس نصف آلبالوها را بریزید. مجددا قدری برنج ریخته کوفته ریزه را و بعد بقیه برنج را ریخته و در آخر یک استکان زعفران دم کرده را روی برنج ریخته و بر آتش ملایم دم کنید.\n" +
                "بدیهی است که این پلو موقعی به حد کافی لذّت بخش خواهد بود که برنجش اعلا، گوشتش تازه، روغنش خوب و زعفرانش عالی باشد.\n" +
                "طرز تهیه نوع دوم:\n" +
                "تفاوت شیوه طبخ نوع دوم با نوع اول در این است که در این روش به جای گوشت چرخ کرده از گوشت تکه ای استفاده می کنیم.\n" +
                "گوشت گوسفند یا گوساله را خرد کرده آب پز می کنیم، سپس گوشت آب پز شده را در پیاز داغ تفت می دهیم و آلبالوی نیم پز شده به همراه شکر را به آن اضافه می کنیم و بعد همراه برنج آبکش شده همانند نوع اول دم می کنیم.\n" +
                "لازم به ذکر است که در صورت عدم دسترسی به آلبالو می توانید از مربای آلبالو نیز استفاده کنید. در این صورت شکر را حذف می کنیم؛ چرا که خود مربای آلبالو شیرین است.\n" +
                "این پلو که از غذاهای اصیل ایرانی است علاوه بر طعم خوب به علت تنوع رنگی که دارد (قرمز، زرد، سفید، قهوه ای) بسیار زیبا و چشم نواز است و خانمهای با سلیقه می توانند با این غذا پذیرای مهمانان عزیزشان باشند.\n" +
                "گل در چمن یا باقلا قاتق (رشتی)\n" +
                "مواد لازم: (برای 4 نفر)\n" +
                "باقلا 750 گرمتخم مرغ: 3 عدد شوید: 100 گرم\n" +
                "روغن: 200 گرمسیر: یک حبهنمک: قدری زعفران: مقداری\n" +
                "پوست باقلا را کنده در کمی روغن با شوید، نمک، زعفران، فلفل و سیر نیم تفت دهید، سپس کمی آب ریخته تا باقلا و شوید پخته شوند. آن گاه تخم مرغها را روی آنها می شکنیم. بعد از آن که تخم مرغها مانند نیمرو پخته شد غذا را از روی حرارت بر می داریم.\n";
        poloalbalo.id = R.mipmap.albalopolo;
        poloalbalo.k.add("آلبالو");
        poloalbalo.k.add("گوشت");
        poloalbalo.k.add("زعفران");


        kol.add(poloalbalo);







       ghaza chelokabab= new ghaza();
        chelokabab.title ="چلو کباب";
        chelokabab.desc="مواد لازم برای 6 نفر:\n" +
                "- گوشت چرخ كرده:یك كیلوگرم گوشت گوسفندی و یا ترکیبی از گوشت گوساله و گوسفندی ( به نسبت 50%)\n" +
                " پیاز: 300 گرم یا یک عدد پیاز بزرگ برای هر کیلو گوشت\n" +
                "زعفران ساییده شده: یك قاشق چای\u200Cخوری\n" +
                "نمك و فلفل؛ به مقدار كافی\n" +
                "\n" +
                "نکاتی به نگام خرید گوشت مورد نیاز:\n" +
                "1- مناسب ترین گوشت برای پخت کباب کوبیده، گوشت قلوه گاه (گوشت بین دنده ها) گوسفند است. در صورت تمایل به استفاده از گوشت گوساله بهتر است راسته را انتخاب کنید که چربی کمتری دارد چرا که چربی مورد نیاز توسط گوشت گوسفندی تامین می شود. پخت كباب كوبیده با گوشت گوساله به\u200Cتنهایی امكان ندارد زیرا گوشت گوساله فاقد چربی لازم است. البته استفاده از قسمت\u200Cهای خیلی چرب گوشت گوسفند نیز برای پخت كباب كوبیده و سلامتی شما مناسب نیست.\n" +
                "\n" +
                "2- گوشت خریداری شده باید حتما چندین بار (دست کم 4 بار) چرخ شود. این کار به ورز داده شدن گوشت کمک کرده و از متلاشی شدن کباب شما جلوگیری می کند.\n" +
                "\n" +
                "روش آماده سازی و عمل آوری:\n" +
                "1 - ابتدا كاسه بزرگی آماده كرده و پیازها را پس از پوست كندن و شستن با رنده ریز در آن رنده كنید.\n" +
                "نکته1: مقدار پیاز نباید زیاد باشد چراکه گوشت را آبدار کرده و موجب ریختن آن به هنگام پخت می شود و دیگر اینکه کباب را شیرین و بد مزه می کند.\n" +
                "نكته 2: حتما پیاز رنده شده را  با دست بچلانید و آب اضافی آن را خالی كنید.\n" +
                "\n" +
                "2 - گوشت چرخ كرده را همراه با نمك و فلفل به پیاز رنده شده اضافه كنید.\n" +
                "نکته: افزودن فلفل تنها برای گرفتن بوی بد گوشت است و نباید موجب تند شدن غذای شما شود.\n" +
                "\n" +
                "3- زعفران ساییده شده را نیز در كمی آب\u200Cجوش حل كرده و در این مخلوط گوشتی بریزید و با دست\u200Cتان مواد را خوب ورز دهید تا مایه كباب حالت چسبنده پیدا كند.  همانطور که گفته شد این چسبندگی راز موفقیت شما در پخت این کباب است بنابراین گوشت را آنقدر ورز دهید که بتوانید با یک حرکت همه آن را از داخل ظرف بلند کنید و گوشت جدا نشده و نریزد. سپس مخلوط گوشتی را به مدت 2 تا 3 ساعت در یخچال و یا بیرون از آن قرار دهید تا اصطلاحا عمل آید.\n" +
                "\n" +
                "به سیخ کشیدن کباب ها:\n" +
                "1-برای سیخ كردن كباب هم باید توجه داشته باشید که از سیخ های پهن برای پخت این کباب باید استفاده کنید.\n" +
                "2- قبل از اینکه شروع به کار کنید هم مقدماتی لازم است. ابتدا در كاسه كوچكی مقداری آب سرد بریزید و كنار دست\u200Cتان قرار دهید. حالا پیش از برداشتن مایه كباب دست\u200Cتان را در آب خیس كرده، یك مشت از مایه را بردارید و به شكل دوك درآورید؛ سپس همان\u200Cطور كه مواد در دست راست\u200Cتان قرار دارد، سیخ را روی مایه دوكی بگذارید و شروع به پوشاندن سطح سیخ با مایه كباب كنید.\n" +
                "در پایان دوباره دست\u200Cتان را در آب سرد فرو كنید و روی سیخ فشار دهید تا اثر انگشتان شما بر گوشت باقی بماند. حالا ابتدا و انتهای كباب را به سیخ بچسبانید و كناری بگذارید. همین كار را درباره همه مواد و سیخ\u200Cها انجام دهید.\n" +
                "\n" +
                "نحوه پخت:\n" +
                "اکنون آتش را بر پا كرده، سیخ\u200Cها را روی آن قرار دهید. دقت کنید که اگر آتش را توسط ذغال و هیزم دایر کرده اید باید صبر کنید تا شعله آن فروکش کرده و تنها ذغال گداخته در منقل شما وجود داشته باشد. این برای این است که در صورتی که از مواد اشتعال زایی همچون نفت استفاده کرده باشید، بوی آن از بین رفته و غذای شما بد بو نشود و یا اینکه دوده هیزم و یا ذغال شما به طور کامل سوخته باشد و بر روی غذای شما ننشیند.\n" +
                "\n" +
                "سپس سیخ های کباب را روی آتش بچینید. فقط به خاطر داشته باشید كه ابتدا باید سیخ ها را مرتب و با دقت به دفعات بچرخانید تا گوشت خودش را بگیرد؛ وگرنه به دلیل خام بودن یک طرف کباب و سفت شده طرف دیگر کباب متلاشی شده و بر روی آتش می ریزد. وقتی گوشت كمی برشته شد، دیگر باد زدن لازم نیست.\n" +
                "\n" +
                "نكته: با وجود اینكه طبق این دستور دیگر نباید نگران ریختن كباب باشید ولی برای اطمینان بیشتر یكی دو تخم\u200Cمرغ به مایه كباب اضافه كنید.\n" +
                "\n" +
                "نحوه سرو غذا:\n" +
                "\n" +
                "شما می توانید برای خوشمزه تر شدن غذای خود آن را با مخلفاتی چون گوجه و فلفل سبز سرخ شده و سماق و سبزی های معطر، بویژه ریحان و نوشیدنی سالمی چون دوغ به همراه کمی نان تازه میل کنید.\n" +
                "در صورت تمایل هم می توانید آن را به همراه پلو و به صورت چلو کباب نوش جان کنید.";
        chelokabab.id = R.mipmap.chelokabab;
        chelokabab.k.add("گوشت");
        chelokabab.k.add("پیاز");
        chelokabab.k.add("زعفران");

        kol.add(chelokabab);












        ghaza khoreshbamiye= new ghaza();
        khoreshbamiye.title ="خورش بامیه";
        khoreshbamiye.desc="مواد لازم :\n" +
                "گوشت            400گرم\n" +
                "بامیه               200گرم\n" +
                "گوجه فرنگی      3عدد\n" +
                "لیمو عمانی       2عدد\n" +
                "رب گوجه فرنگی 1 قاشق غذاخوری\n" +
                "پیاز سرخ شده   2 قاشق غذا خوری\n" +
                "نمک و زردچوبه به مقدار لازم\n" +
                "دارچین نکوبیده  1 قطعه \n" +
                "طرز تهیه :\n" +
                "ابتدا گوشت را به همراه یک عدد پیاز رنده شده و یک تکه چوب دارچین نکوبیده بپزید. در اواسط پخت بامیه و نمک و زرد چوبه و رب را به آن اضافه کنید. بامیه را تاحدی بپزید که له نشود. لیمو عمانی را با پوست قطعه قطعه کرده و به خورش اضافه کنید پنج دقیقه به پایان پخت گوجه فرنگی را پوست کنده و دانه های آن را بگیرید و به قطعات کوچک تقسیم کنید و به همراه پیاز داغ در خورش بریزید و سعی کنید که زیاد پخته نشود.حالا دارچین را از خورش در آورده و دور بیندازید . خیلی آرام و با دقت خورش را در ظرف بکشید تا بامیه هاسالم بمانند.\n";
        khoreshbamiye.id = R.mipmap.khoreshbamiye;
        khoreshbamiye.k.add("گوشت");
        khoreshbamiye.k.add("بامیه");

        khoreshbamiye.k.add("پیاز");

        kol.add(khoreshbamiye);





        ghaza khoreshlobiyasabz= new ghaza();
        khoreshlobiyasabz.title ="خورش لوبیا سبز";
        khoreshlobiyasabz.desc="\n" +
                "\n" +
                "    لوبيا سبز خرد شده 500 گرم\n" +
                "    گوشت گوسفند 200 گرم\n" +
                "    سيب زميني 2 عدد كوچك\n" +
                "    پياز 1 عدد متوسط\n" +
                "    زرد چوبه، فلفل، و نمك به مقدار لازم\n" +
                "    رب گوجه فرنگي دو قاشق غذا خوري پر\n" +
                "    ليمو عماني يك يا دوعدد\n" +
                "\n" +
                "ﺭﻮﺘﺳﺩ\n" +
                "ﺖﺨﭘ\n" +
                "\n" +
                "    ابتدا پياز ها را در روغن سرخ كرده و تا زماني كه كمي طلايي شده گوشت را به آن اضافه مي كنيم و با پياز سرخ مي كنيم.\n" +
                "    فلفل و زردچوبه را به آن اضافه مي كنيم و كمي تفت مي دهيم. (وقتي غذا پخت نمك را اضافه ميكنيم.)\n" +
                "    وقتي گوشت سرخ شد، به آن آب اضافه مي كنيم و ميگذاريم گوشت بپزد. ليمو عماني را اينجا اضافه ميكنيم. حدودا نيم ساعت بعد (وقتي گوشت نيم پز شد) لوبيا سبز را به آن اضافه ميكنيم.\n" +
                "    نيم ساعت بعد سيب زميني را به اندازه دلخواه خرد كرده و اضافه ميكنيم.\n" +
                "    سپس رب را جدا گانه در روغن سرخ كرده (به مدت 5 دقيقه) و به غذا اضافه ميكنيم. و ميگذاريم غذا كاملا جا بيافتد و روغن بياندازد.\n" +
                "\n" +
                "نکته: برای خوش طعم شدن غذا، هنگام سرخ کردن رب می توانید به آن یک قاشق آب لیمو و کمی آویشن و دارچین به آن اضافه کنید. این کار سس شما را بسیار خوشمزه می کند.";
        khoreshlobiyasabz.id = R.mipmap.lobiyasabz;
        khoreshlobiyasabz.k.add("لوبیا");
        khoreshlobiyasabz.k.add("گوشت");
        khoreshlobiyasabz.k.add("سیب زمینی");
        khoreshlobiyasabz.k.add("پیاز");

        kol.add(khoreshlobiyasabz);





        ghaza dolmeyebargmo= new ghaza();
        dolmeyebargmo.title ="دلمه برگ مو";
        dolmeyebargmo.desc="\n" +
                "    برگ مو نیم کیلو گرم\n" +
                "    گوشت چرخ کرده نیم کیلو گرم\n" +
                "    سبزی دلمه نیم کیلو گرم\n" +
                "    برنج ۱۵۰گرم\n" +
                "    لپه۱۰۰ گرم\n" +
                "    پیاز سرخ کرده۴-۳ قاشق سوپ خوری\n" +
                "    آب لیمو ترش یک استکان\n" +
                "    شکر ۴-۳ قاشق سوپ خوری\n" +
                "    روغن حدود ۱ پیمانه سرخالی\n" +
                "    نمک و فلفل و زردچوبه به مقدار کافی\n" +
                "\n" +
                "توجه:\n" +
                "\n" +
                "- سبزی دلمه شامل: تره، جعفری، نعناع، شوید، ترخون و گاهی پیازچه می\u200Cباشد.\n" +
                "\n" +
                "- برگ موها بهتر است جوان باشد.\n" +
                "\n" +
                "- در صورت تمایل می\u200Cتوانید از لپه استفاده کنید و اجباری نیست.\n" +
                "\n" +
                "طرز تهیه:\n" +
                "\n" +
                "چوب ته برگ موها را می\u200Cگیریم و برگ\u200Cها را می\u200Cشوییم. در قابلمه آب را جوش می\u200Cآوریم و برگ\u200Cها را در آن می\u200Cریزیم همین که یکی دو جوش زد و برگ نرم شد در صافی ریخته و روی آن آب سرد می\u200Cریزیم.\n" +
                "\n" +
                "برای تهیه مواد داخل دلمه، پیاز سرخ شده را با گوشت چرخ کرده مخلوط کرده و تفت می\u200Cدهیم. سپس برنج و لپه\u200Cای که نیم پز شده است را اضافه می\u200Cکنیم. نمک، فلفل، زردچوبه و در نهایت سبزی خرد شده را هم با بقیه مواد مخلوط می\u200Cکنیم. می\u200Cتوان به این مواد کمی آب لیمو هم اضافه کرد. سپس برگ\u200Cها را باز کرده، دو برگ را طوری کنار هم قرار می\u200Cدهیم که شکاف برگ\u200Cها گرفته شود. کمی از مواد دلمه وسط برگ می\u200Cریزیم و اطراف برگ را روی هم می\u200Cگذاریم و محکم می\u200Cپیچیم.\n" +
                "\n" +
                "در یک قابلمه ۳-۲ قاشق روغن می\u200Cریزیم، دو سه ردیف برگ ساده ته ظرف می\u200Cچینیم. سپس دلمه\u200Cها را نزدیک هم و بدون فاصله روی برگ\u200Cها می\u200Cچینیم و ۳-۲ قاشق روغن آب کرده روی آن\u200Cها می\u200Cدهیم و یک لیوان آب داخل ظرف دلمه می\u200Cریزیم. بهتر است بشقابی کوچک تر از دهانه ظرف را وارونه روی دلمه قرار داده و در ظرف دلمه را بسته و قابلمه را روی حرارت ملایم قرار دهیم تا دلمه\u200Cها بپزند. در صورتی که با این مقدار آب، دلمه پخته نشد، مقداری آب اضافه می\u200Cکنیم و در اواخر طبخ بقیه آبلیمو، نمک و شکر را مخلوط کرده، داخل دلمه می\u200Cریزیم.\n" +
                "\n" +
                "وقتی این مواد جذب دلمه شد، آن را از روی آتش بر می\u200Cداریم. باید توجه داشت در صورتی که چاشنی دلمه را زود بزنیم برگ دلمه سفت می\u200Cشود. دلمه برگ مو را می\u200Cتوان بدون شکر تهیه کرد. بهتر است به مواد وسط دلمه کمی گوجه سبز هسته گرفته اضافه کنیم و یا لای هر ردیف دلمه کمی گوجه سبز بریزیم.";
        dolmeyebargmo.id = R.mipmap.dolme;
        dolmeyebargmo.k.add("گوشت");
        dolmeyebargmo.k.add("سبزی");
        dolmeyebargmo.k.add("برنج");
        dolmeyebargmo.k.add("لپه");
        dolmeyebargmo.k.add("پیاز");
        kol.add(dolmeyebargmo);





        ghaza sabzipolobamahighezelala= new ghaza();
        sabzipolobamahighezelala.title ="ماهی و پلو شوید";
        sabzipolobamahighezelala.desc="مواد لازم:\n" +
                "برنج 2 پیمانه\n" +
                "سبزی پلویی ( تره فرنگی/ سیرتازه/ جعفری/ گشنیز )  300 گرم\n" +
                "ماهی قزل آلا  2 عدد\n" +
                "آبلیمو به مقدار لازم\n" +
                "نمک / زردچوبه و فلفل  به مقدار لازم\n" +
                "روغن  به مقدار لازم\n" +
                "\n" +
                "طرز تهیه:\n" +
                "ابتدا برنج را آبکش میکنیم ,سپس مقداری روغن در قابلمه می ریزیم و مقداری از برنج آبکشی شده را داخل قابلمه می ریزیم بعد مقداری از سبزی پلویی را روی برنج می ریزیم به همین ترتیب سبزی را لا به لای برنج می ریزیم  و برنج را دم میگذاریم  ماهی را پس از تمیز کردن و شستن از وسط نصف کنید این کار باعث میشود که ماهی خیلی خوب سرخ شود سپس ماهی را در زردچوبه /فلفل/نمک و آبلیمو به مدت 1 ساعت می خوابانیم و آن را در یخچال می گذاریم تا ماهی مزه دار شود سعی کنید تمام سطح ماهی به  این مواد آغشته شود پس از 1 ساعت ماهی را از داخل مواد بیرون می آوریم و در روغن داغ شده سرخ می کنیم توجه داشته باشید موقع سرخ کردن ماهی اول یک طرف ماهی  خوب سرخ شود  بعد آن را به طرف دیگر برگردانیم  وگرنه ماهی خورد می شود.";
        sabzipolobamahighezelala.id = R.mipmap.sabzipolobamahi;
        sabzipolobamahighezelala.k.add("برنج");
        sabzipolobamahighezelala.k.add("سبزی");
        sabzipolobamahighezelala.k.add("ماهی");


        kol.add(sabzipolobamahighezelala);










        ghaza zereshkpolobamorgh= new ghaza();
        zereshkpolobamorgh.title ="زرشک پلو با مرغ";
        zereshkpolobamorgh.desc="مواد لازم برای ۴ نفر:\n" +
                "\n" +
                "برنج: ۵ پیمانه \n" +
                "زرشک: ۴ قاشق غذاخوری \n" +
                "شکر: ۱ قاشق غذا خوری \n" +
                "خلال پسته و بادام: از هر کدام یک قاشق غذاخوری \n" +
                "گلاب: کمی \n" +
                "مرغ: ۴ تکه \n" +
                "رب گوجه فرنگی \n" +
                "فلفل دلمه ای سبز: نصف یک عدد \n" +
                "پیاز: ۲ عدد درشت \n" +
                "سیر: ۲ حبه \n" +
                "ادویه مرغ: ۱ قاشق مربا خوری \n" +
                "زردچوبه: ۱ قاشق مرباخوری \n" +
                "زعفران دم کرده: یک چهارم پیمانه \n" +
                "کره و روغن حیوانی \n" +
                "روش تهیه: \n" +
                "\n" +
                "روش تهیه برنج کته: \n" +
                "\n" +
                "۱- اول اینکه من هر وقت که کمتر از ۲۰ تا مهمون داشته باشم برنج رو کته درست میکنم. اگه بخوام ته چین بذارم ام توی یه تابه جداگانه آماده ش میکنم. به خاطر اینکه اولا دیگه حسابی دستم اومده که چطوری برنج رو کته کنم که قشنگ در بیاد و بعد هم اینکه خواص برنج رو از بین نبردم و خوب کارم هم راحت تر کردم. \n" +
                "۲- و یه چیز دیگه. خواهش میکنم، خواهش میکنم از برنج ایرانی استفاده کنید. برای اینکه واقعا عطر و طعمش بی نظیره. واقعا چه اهمیتی داره که برنج چقد قد بکشه؟ (من که خودم هیچ وقت برنج غیر ایرانی درست نکردم. اما دیدم که چقد زیادی قد میکشه و واقعا چه بو و طعم بدی داره. من که اصلا غذا با برنج خارجی بهم نمیچسبه) مثلا یکی میخواد بگه ببین برنجش خوب نشده بلد نیست برنج بپزه. نهایتش اینه دیگه. اما اینجوری هم میتونیم مطمئن باشیم که برنج سالم داریم مصرف میکنیم و هم اینکه به هموطنای خودمون که با زحمت برنج میکارن کمک کردیم و هم اینکه از عطر و طعم خوب برنج ایرانی لذت میبریم. \n" +
                "۳- بعد از اینکه برنج رو پیمانه کردید و پاک کردید و شستید، ۵ تا لیوان پر (لیوان هاتون اگه کوچیک بود، حدود نصف لیوان دیگه هم اضافه کنید.) آب جوشیده ای که داغ نیست اما گرمه اضافه کنید و حدودا ۱ ساعت اجازه بدید که خیس بخوره. میشه ام این مرحله رو حذف کرد اما اگه خیس بخوره بعدا قشنگ تر میپزه. من سایز لیوان های خودم و پیمانه برنجم رو هم گذاشتم. این دو تا لیوان تقریبا یه حجم دارن. \n" +
                "۴- بعد از خیس خوردن، نمک رو اضافه کنید. ۱ قاشق پر روغن حیوانی کرمانشاهی هم اضافه کنید و روی حرارت بذارید. \n" +
                "۵- برای اینکه برنج کته خوبی داشته باشید، اول حرارت رو زیاد کنید و قابلمه رو بدون در روی حرارت قرار بدید. بعد از اینکه جوش اومد بازم حرارت رو کم نکنید برای اینکه باید در قابلمه باز باشه و اگه حرارت رو کم کنید از جوش میفته. میخوایم که تمام مدت تا وقتی که آب برنج تموم بشه در حال قل زدن باشه. یه بار هم برنج رو یه هم بزنید که نمک و روغن مخلوط بشه. \n" +
                "۶- وقتی که دیگه ته قابلمه حدود ۲ سانت آب باقیمونده مونده بود، حرارت رو خیلی خیلی کم کنید و در قابلمه رو هم ببندید. اگه میخواستید که برنج قالبی در بیاد که هیچی اما اگه میخواستید معمولی توی دیس بکشید، برنج رو وسط قابلمه جمع کنید که دیواره هاش ته دیگ نشه. \n" +
                "۷- بعد از این در قابلمه رو برندارید. اجازه بدید که با بخار خودش بپزه. اگه درش رو بردارید و بخارهاش خارج بشه، بعدا مجبور میشید باز آب اضافه کنید و اونوقت برنجتون شفته میشه. بعد اینکه احساس کردید دیگه بخارش تموم شده، درش رو برداید. چند تا دونه رویی رو کنار بزنید و از یکم زیرتر، یه دونه برنج رو بردارید و امتحان کنید. اگه هنوز کاملا نپخته بود، فقط به اندازه یک چهارم پیمانه آب اضافه کنید و باز درش رو کاملا محکم ببنید تا بخارش خارج نشه. اینم فقط زمانی اتفاق میفته که شما اولین باره که دارید به این روش برنج رو میپزید. اگه اولین بار این اتفاق افتاد، دفعه بعد، یه مقدار به آبی که اون اول تو برنج ریختیم اضافه کنید. دیگه خودتون دستتون میاد که با پیمونه برنج و پیمونه آب چه جوری بازی کنید که دیگه آب اضافه کردن نخواد. \n" +
                "۸- اگه هم که بعد از اینکه چشیدید، برنج پخته بود، دیگه میل خودتونه که همون موقع از رو حرارت بردارید و سرو کنید یا اینکه اجازه بدید روی حرارت باشه تا یه ته دیگه قشنگ درست بشه. فقط اگه کاملا پخته بود، از اینجا به بعد از دم کنی استفاده کنید تا آب بخار شده، توی برنج برنگرده و برنجتون خراب نشه. \n" +
                "با این روش یه برنج کته ایرانی خیلی عالی و خوش طعم دارید. \n" +
                "روش تهیه زرشک: \n" +
                "۱- برای اینکه یه زرشک خوش رنگ و خوش طعم داشته باشید هم چند تا نکته رو باید رعایت کنید. اول اینکه زرشک رو باید خیلی خوب بشورید تا بعدا مزه خاک نده. زرشک رو توی یه آبکش کوچیک بریزید و بعد توی یه ظرف که پر از آبه قرار بدید طوری که زرشک ها کاملا داخل آب باشن. بعد از ۵ دقیقه یه بار زرشک ها رو یه تکون بدید و بعد دوباره ۵ دقیقه دیگه توی آب قرار بدید تا کاملا خاکش جدا بشه. بعد از این مدت، از آب خارج کنید و با آب تمیز بشورید و کنار بذارید تا آبش بره. \n" +
                "۲- حالا یک چهارم لیوان آب و کره رو توی یه تابه کوچیک بریزید وقتی که گرم شد، ۱ قاشق مرباخوری شکر اضافه کنید و هم بزنید تا خوب مخلوط بشه. بعد روی حرارت بذارید باشه تا آبش تقریبا جمع بشه و فقط یکم آب داشته باشه. \n" +
                "۳- حالا زرشک رو اضافه کنید و یه چرخ کوچیک بدید تا زرشک یه کوچولو پف کنه و رنگش روشن بشه و بعد از روی حرارت بردارید. \n" +
                "۴- میتونید زعفران رو با زرشک قاطی کنید و بعد یکم برنج توش بریزید و روی دیس برنجتون بدید. میشه هم زعفران و زرشک رو جداگانه آماده کنید. اما به نظر من اگه با هم باشه قشنگتره. \n" +
                "۵- من یادم رفت اما شما خلال پسته و بادام رو توی یکم گلاب خیس کنید و بعد از اینکه زرشک آماده شد باهاش مخلوط کنید. \n" +
                "روش تهیه مرغ: \n" +
                "\n" +
                "۱- تیکه های مرغ رو از چند ساعت قبل (یا حتی شب قبل) توی قابلمه بچینید. بیشتر از ۲ ردیف نچینید برای اینکه بعدا مرغ ها له میشن. \n" +
                "۲- پیاز رو رنده کنید و لا به لای مرغها بریزید. فلفل دلمه ای رو هم چند تا تیکه درشت کنید و لابلای مرغها قرار بدید. سیر ها رو هم یا له کنید یا درسته بندازید توی قابلمه. درش رو بذارید و توی یخچال قرار بدید تا مرغ طعم دار بشه. \n" +
                "۳- وقتی که خواستید مرغ رو بپزید و از یخچال خارج کردید، حدود ۲ لیوان آب بریزید. نمک و ادویه و زردچوبه رو هم بزنید. یه دونه دیگه پیاز درسته هم چهار قاچ کنید بدون اینکه کاملا بریده بشه تو قابلمه بندازید طوری که بعدا بتونید درسته در بیاریدش. \n" +
                "۴- بعد از اینکه آب جوش اومد، حرارت رو کم کنید و اجازه بدید حدودا ۴۵ دقیقه روی حرارت باشه تا بپزه. اوایل پخت یکی دو بار سر بزنید و ناخالصی هایی که روی سطح آب اومده رو جمع کنید که بعدا به مرغ ها نچسبه و ظاهرشون رو خراب نکنه. \n" +
                "۵- اواسط پخت حدود ۲ قاشق روغن رو توی تابه گرم کنید و ۲ قاشق پر رب رو توی روغن یکم تفت بدید تا رنگش آزاد بشه. رب رو با توجه به رنگ ربی که دارید خودتون تنظیم کنید. \n" +
                "بعد رب رو توی مرغ بریزید. دقت کنید که نباید رب رو با قاشق هم بزنید توی مرغ به خاطر اینکه ممکنه مرغ هاتون رو له کنید. پس دقت کنید که رب رو با قاشق تو جاهای مختلف قابلمه بریزید. یعنی همه ش رو یک جا نریزید و بعد هم اجازه بدید چند تا قل که زد، خود قابلمه رو به صورت دایره ای تکون بدید تا رب کم کم پخش بشه. اگه رنگش به نظرتون هنوز خوب نبود، بازم به همون روش رب اضافه کنید. \n" +
                "۶- اواخر پخت هم ۳ قاشق غذا خوری زعفران اضافه کنید. میتونید از ریشه زعفران هم استفاده کنید. چون اینجا رنگ زعفرون برامون مهم نیست (چون قبلا با رب کاملا رنگش رو مناسب کردیم) فقط عطر زعفران رو میخوایم. \n" +
                "۷- دقت کنید که مرغ در آخر نباید آبدار باشه. باید یه سس نسبتا غلیظ داشته باشه. پس از اول اگه آب رو کم بریزید، خیلی بهتره برای اینکه آخرش مجبور نیستید یا آب اضافی مرغ رو بردارید یا صبر کنید تا آب اون تبخیر بشه و مرغ ها له بشن. آب رو اگه کم بریزید، هرجا احساس کردید کم آب شد بهش یکم آب در حال جوش اضافه کنید. \n" +
                "۸- آخر کار هم یکم از سس رو بچشید. نمک و ادویه ش رو اندازه کنید و مرغتون آماده است. \n" +
                "توی یه ظرف خوشگل بچینید و سس رو هم روش بریزید (البته بدون تیکه های فلفل دلمه ای و اون پیاز درسته) و در کنار برنج خوشگلتون سرو کنید.\n" +
                " \n" +
                "۱۱ راز زرشک\u200Cپلو\n" +
                "زرشک از میوه\u200Cهایی است که در دو نقطه ایران بیش از هر جای دیگری پرورش می\u200Cیابد؛ زرشک قرمز در جنوب خراسان فراوان است و زرشک سیاه در کرمانشاه. به همین دلیل این غذا (زرشک\u200Cپلو) در مناطقی مانند خراسان طبخ و به سایر نقاط کشور معرفی شده است. بسیاری از افراد تصور می\u200Cکنند که روش طبخ این غذا بسیار ساده است در حالی که رعایت نکته\u200Cهای ظریفی در آن لازم و نشانه حرفه\u200Cای بودن آشپز است:\n" +
                "۱٫ برای اینکه غذای\u200Cتان طعم بهتری داشته باشد، قبل از طبخ، تکه\u200Cهای مرغ را در روغن سرخ و بعد از طلایی شدنشان، به آن\u200Cها پیاز و ادویه و آب اضافه کنید.\n" +
                "۲٫ پیازی که به مرغ اضافه می\u200Cشود باید درسته باشد به همین دلیل پیازهای کوچک را انتخاب کنید و ۲ تا ۳ عدد از آن\u200Cها را در ظرف حاوی مرغ بیندازید.\n" +
                "۳٫ ادویه\u200Cهای مورد نیاز برای طبخ مرغ فقط زردچوبه و کمی نمک است. مرغی که برای این غذا استفاده می\u200Cشود باید زردرنگ باشد، به همین دلیل افزودن زعفران و رب گوجه\u200Cفرنگی را به هیچ\u200Cوجه توصیه نمی\u200Cکنم.\n" +
                "۴٫ مرغ باید آبدار باشد، البته آب غلیظ شده. آب مرغ را باید در کاسه\u200Cای جدا از مرغ سرو کرد.\n" +
                " ۵٫ روغنی که برای سرخ کردن زرشک استفاده می\u200Cکنید باید تازه باشد و البته کره برای این کار بهتر است.\n" +
                "۶٫ شکر را باید به زرشک در حال حرارت دیدن افزود زیرا هم باعث می\u200Cشود زرشک\u200Cها روی برنج بچسبند، هم غذا طعم ترش و شیرین پیدا کند.\n" +
                "۷٫ زرشک را باید روی حرارت ملایم تفت داد زیرا حرارت دیدن بیش از اندازه آن باعث خشک شدنش می\u200Cشود و هنگام خوردن به دندان\u200Cها می\u200Cچسبد.\n" +
                "۸٫ برای آنکه زعفران خوب رنگ بدهد، آن را در هاون سنگی یا چوبی آسیاب کنید نه در دستگاه آسیاب برقی زیرا با این کار عطر و بوی خود را از دست خواهد داد.\n" +
                "۹٫ برای آنکه زعفران کاملاً رنگ بدهد، کره را قبل از اینکه کاملاً آب شود با زرشک، زعفران و شکر در تابه\u200Cای بریزید و وقتی کمی حرارت دید، نصف استکان آب به آن اضافه کنید و بعد از چند دقیقه آن را از روی حرارت بردارید. نگذارید زعفران روی حرارت زیاد بماند زیرا این کار عطر این ادویه را کم خواهد کرد.\n" +
                "۱۰٫ برخی خانم\u200Cها زعفران به اصطلاح آب کرده را در ظرفی در بسته در یخچال نگهداری می\u200Cکنند. این کار کاملاً اشتباه است و باعث می\u200Cشود این ادویه عطر و طعم خود را از دست بدهد و برای افزودن به غذا مناسب نباشد.\n" +
                "۱۱٫ برای زیباتر شدن این غذا، پس از سرو آن روی زرشک\u200Cها یک قاشق غذاخوری خلال پسته نیز بریزید. رنگ سبز آن در کنار قرمزی زرشک، ظاهر زیبایی به زرشک\u200Cپلو خواهد داد.\n" +
                "\n";
        zereshkpolobamorgh.id = R.mipmap.morghbazreshkpolo;
        zereshkpolobamorgh.k.add("برنج");
        zereshkpolobamorgh.k.add("زرشک");
        zereshkpolobamorgh.k.add("مرغ");
        zereshkpolobamorgh.k.add("پیاز");
        zereshkpolobamorgh.k.add("سیر");
        zereshkpolobamorgh.k.add("زعفران");
        kol.add(zereshkpolobamorgh);





        ghaza kokosebzamini= new ghaza();
        kokosebzamini.title ="کوکو سیب زمینی";
        kokosebzamini.desc="مواد لازم کوکوی سیب زمینی\n" +
                "\n" +
                "    سیب زمینی=یک کیلو\n" +
                "    تخم مرغ=4 تا 5 عدد\n" +
                "    پکینگ پادر یا جوش شیرین=یک قاشق مرباخوری سرخالی\n" +
                "    نمک و فلفل=به مقدار کافی \n" +
                "طرز تهیه کوکوی سیب زمینی\n" +
                "\n" +
                "\n" +
                "سیب زمینی را می پزیم و پوست می کنیم و از رنده یا ماشین رد می کنیم، بعد تخم مرغ ها را در ظرفی می شکنیم و خوب می زنیم تا کاملا کف کند. کمی نمک و فلفل و بیکینگ پودر را داخل تخم مرغ می ریزیم و سیب زمینی را که کاملا سرد شده است داخل مایه تخم مرغ اضافه می کنیم و بهم می زنیم. در تابه یا ظرف نسوزی سه چهار قاشق سوپخوری روغن می ریزیم می گذاریم داغ شود و مایه را در روغن می ریزیم حرارت را ملایم می نمائیم با پشت قاشق روی آنرا صاف می کنیم تا سطح آن در همه جا به یک اندازه شود. در تابه را می گذاریم حرارت را باز هم کمی ملایمتر می کنیم تا مایه کاملا بسته شده قابل بریدن شود. کوکو را ابتدا به شکل بعلاوه می بریم با دو چنگال قطعات کوکو را برمی گردانیم و باز هر قطعه را دو نیم می کنیم در اینصورت هشت قطعه کوکو خواهیم داشت می گذاریم قسمت زیرین کوکو هم سرخ شود بعد در ظرف گرد مناسبی قطعات کوکو را می چینیم و اطراف آنرا با حلقه های گوجه فرنگی تزیین می نماییم.\n" +
                " دو طعم شیرین و شور هم برای پخت این غذا انتخاب می شود به طوری که برخی به نوع تهیه شده با سیب زمینی پخته شهد و به نوع تهیه شده با سیب زمینی خام نمک می زنند. معمولا کوکویی که با سیب زمینی پخته تهیه می شود، با موادی مانند هل، دارچین و مغز گردو یا گوشت چرخ کرده یا حتی قارچ سرخ شده هم پر می کنند. در زیر نکات ریز تهیه کوکوها و رمز و راز و فوت و فن تهیه آن تعریف شده و همچنین طرز تهیه انواع کوکوی سیب زمینی لینک داده شده است.\n" +
                "\n" +
                "اصفهانی ها به این غذا کوکو قندی می گویند و روی آن شهد می ریزند برای آماده سازی و پخت این غذا باید نکته هایی را در نظر گرفت که به ترتیب عبارتند از:\n" +
                "\n" +
                "1. اگر کوکو را با سیب زمینی خام تهیه می کنید، می توانید به آن مرغ پخته ریش ریش شده یا سبزی های معطر اضافه کنید اما افزودن این مواد به مایه کوکو تهیه شده با سیب زمینی پخته توصیه نمی شود.\n" +
                "\n" +
                "2. خیلی وقت ها کوکو پس از پخت ترک برمی دارد و در هنگام جابجا کردن می شکند. علت این اتفاق مقدار کم تخم مرغ است اما باید مراقب باشید بیش از اندازه هم تخم مرغ استفاده نکنید زیرا در این صورت، بافت کوکو از میان می رود و شکل اسفنجی و کف آلود پیدا می کند.\n" +
                "\n" +
                "3. خیلی ها به کوکو سیب زمینی، پیاز خام می زنند. پیشنهاد می کنم در هنگام افزودن این سبزی، آب آن را بگیرید زیرا باعث شل شدن کوکو و از بین رفتن بافت منسجم آن می شود. به علاوه، در مصرف پیاز نیز زیاده روی نکنید زیرا باعث وارفتن کوکو می شود.\n" +
                "\n" +
                "4. ضخامت مناسبی که برای این کوکو توصیه می شود، بین 5/0 تا 2 سانتی متر است که برحسب ذائقه می توانید آن را تغییر دهید. فراموش نکنید ضخامت زیاد، باعث نپختن کوکو و نازک بودن بیش از حد، باعث خشکی و حتی سوختن آن می شود.\n" +
                "\n" +
                "5. به غیر از نعناع یا گشنیزی که در دستور پخت این غذا وجود دارد، شما می توانید از نعناع تازه به تنهایی یا ریحان تازه و حتی آویشن خشک استفاده کنید. به این ترتیب طعم کوکو منحصربه فرد خواهد شد.\n" +
                "\n" +
                "6. اگر مایه کوکو بر اثر افزودن تخم مرغ ها یا پیاز شل شد، بهتر است به آن کمی آرد سیب زمینی اضافه کنید تا قوام لازم را پیدا کند.\n" +
                "\n" +
                "7. ادویه مناسبی که برای پخت این غذا نباید فراموش کرد، در کوکوی شیرین فقط زعفران و در کوکو نمک دار زعفران و زردچوبه است.\n";
        kokosebzamini.id = R.mipmap.kokosibzamini;
        kokosebzamini.k.add("سیب زمینی");
        kokosebzamini.k.add("تخم مرغ");


        kol.add(kokosebzamini);








        ghaza asnak= new ghaza();
        asnak.title ="اسنک";
        asnak.desc="مواد مورد نیاز برای تهیه اسنک :\n" +
                "قارچ ۱۲ عدد\n" +
                "نان تست ۶ عدد\n" +
                "کره ۴ قاشق غذاخوری\n" +
                "سس مایونز ۳ قاشق غذاخوری\n" +
                "پیاز ۱ عدد\n" +
                "پنیر موزارلای رنده شده ۶ قاشق غذاخوری\n" +
                "گشنیز خرد شده ۱ قاشق غذاخوری\n" +
                "نمک و فلفل مقداری\n" +
                " \n" +
                "دستور تهیه اسنک :\n" +
                "۱- ابتدا همه مواد را به صورت نگینی و خرد شده در بیاورید.\n" +
                "2) به وسیله روغن مواد را تفت دهید و رب و ادویه نیز به مخلوط اضافه نمایید تا به خوبی مخلوط تفت داده شود.\n" +
                "3) سپس یک لایه پنیر پیتزا بر روی نان میریزیم و ۲قاشق از مخلوط را بر روی پنیر پیتزا قرار می دهیم و دوباره بر روی مخلوط پنیر پیتزا میریزیم و لایه دوم نان را بر روی آن قرار می دهیم و آن را در دستگاه اسنگ ساز قرار می دهیم.\n" +
                "پس از ۵ دقیقه اسنک آمادست.\n";
        asnak.id = R.mipmap.asnak;
        asnak.k.add("قارچ");
        asnak.k.add("پیاز");


        kol.add(asnak);







        ghaza koftetabrizi= new ghaza();
        koftetabrizi.title ="کوفته تبریزی";
        koftetabrizi.desc="مواد لازم برای ۴-۶ نفر: \n" +
                "گوشت مغز ران بدون چربی: ۴۵۰ گرم\n" +
                "لپه: ۲۵۰ گرم\n" +
                "تره–مرزه: ۲۰۰ گرم\n" +
                "سینه مرغ بدون استخوان: ۱۰۰ گرم\n" +
                "برنج: ۱ پیمانه\n" +
                "سیب زمینی: ۱ عدد متوسط\n" +
                "پیاز: ۲ عدد متوسط\n" +
                "نمک، فلفل، زرد چوبه: به مقدار لازم\n" +
                "مواد لازم برای داخل کوفته: \n" +
                "تخم مرغ آب\u200Cپز سفت: به تعداد کوفته\u200Cها\n" +
                "آلو خورشی خیس خورده: به تعداد کوفته\u200Cها\n" +
                "پیاز داغ: ۱ استکان\n" +
                "زرشک خیس خورده: ۱ استکان\n" +
                "مغز گردو: ۱ استکان\n" +
                "مواد لازم برای تهیه سس کوفته: \n" +
                "گوجه فرنگی: ۳ – ۴ عدد\n" +
                "پیاز: ۲ عدد متوسط\n" +
                "آب مرغ: ۱ لیوان\n" +
                "زعفران دم کرده: ۱ استکان\n" +
                "نمک، فلفل، زرد چوبه: به مقدار لازم\n" +
                "آلو خورشی خیس خورده: مقدار لازم\n" +
                "طرز تهیه: \n" +
                "برنج و لپه را جداگانه از شب قبل خیس کنید. آب لپه را خالی کنید، یک عدد سیب زمینی را پوست بگیرید و همراه لپه با مقدار مناسبی آب، بدون نمک به مدت ۳۰ دقیقه روی حرارت ملایم با درب باز، بپزید تا سیب زمینی کاملا بپزد و لپه تقریبا پخته شود و بعد آبکش کنید و کنار بگذارید. \n" +
                "برنج را با دو لیوان آب، بدون نمک و با درب باز روی حرارت قرار دهید تا آب آن تقریبا کشید شود، سپس برنج را آبکش کنید و کنار بگذارید. \n" +
                "گوشت را دو تا سه بار چرخ کنید تا کاملا نرم شود. \n" +
                "لپه و سیب زمینی را همراه با هم دو بار چرخ کنید. \n" +
                "سینه مرغ را به صورت خام، چرخ کنید. \n" +
                "۲ عدد پیاز را چرخ کنید و آب آن را بگیرید. \n" +
                "تره و مرزه را بعد از پاک کردن و شستن داخل آبکش بگذارید تا آب آن کاملا چیده شود. بعد کاملا ریز خرد کنید (ساطوری کنید) \n" +
                "در کاسه جاداری، ابتدا گوشت را بریزید و مقداری نمک و فلفل روی آن بپاشید، بعد پیاز چرخ شده و آب گرفته را به آن اضافه کنید و ورز دهید تا حدی که پیاز کاملا به خورد گوشت برود. بعد به ترتیب: نیمی از مخلوط لپه و سیب زمینی، نیمی از برنج، نیمی از مرغ و نیمی از سبزی خرد شده را اضافه کنید و کمی زردچوبه روی مواد بپاشید و مخلوط را ورز دهید تا کاملا باهم مخلوط شوند.\n" +
                "وقتی مواد کاملا مخلوط شدند بقیه مخلوط لپه و سیب زمینی، برنج، مرغ چرخ شده و سبزی را اضافه کنید و به مدت ۱۰-۱۵ دقیقه مایه کوفته را کاملا ورز دهید تا انسجام لازم را پیدا کند. \n" +
                "هنگام ورز دادن مایه کوفته دقت کنید که مایه را یکدست و از یک سمت ورز دهید (چنگ زدن بیش از حد و له کردن مواد باعث می\u200Cشود مواد از هم باز شوند). \n" +
                "بعد از ورز دادن مواد، بگذارید مواد به مدت ۱۵ دقیقه داخل یخچال بماند. \n" +
                "در این فاصله سس کوفته را آماده کنید: \n" +
                "در قابلمه بزرگ و جاداری مقداری روغن بریزید و صبر کنید تا روغن کمی گرم شود. پیاز را خرد کنید و با کمی زردچوبه سرخ کنید تا طلایی شود. گوجه را پوره کنید و بعد از سرخ شدن پیاز به آن اضافه کنید و مقداری نمک و فلفل به آن بزنید. حرارت را بالا ببرید تا آب گوجه کشیده شود (در این مرحله ۱ لیوان آب مرغ را همراه با ۲ لیوان آب به قابلمه اضافه کنید). حرارت همچنان بالا باشد تا آب سس بجوشد، بعد زعفران را به سس اضافه کنید و حرارت زیر قابلمه را کم کنید و درب قابلمه را ببندید تا سس غلیظ شود. \n" +
                "مایه کوفته را از یخچال خارج کنید و بعد از اطمینان از انسجام آن، به اندازه یک پرتقال متوسط از مایه کوفته بردارید و کمی در دست فشار دهید تا اگر آب اضافی دارد گرفته شود، کوفته را به شکل پرتقال در آورید و با انگشت وسط آن را به سمت پائین فشار دهید و کمی انگشتتان را بچرخانید تا حفره ایجاد شده کمی باز\u200Cتر شود، یک عدد تخم مرغ آب پز سفت، مقداری زرشک خیس خورده، یک عدد آلو خورشی خیس خورده و مقداری مغز گردو را وسط کوفته قرار دهید، دوباره مقداری از مایه کوفته را روی حفره ایجاد شده قرار دهید و کوفته را با دست به صورت کروی در آورید و به آرامی میان دستان خود فشار دهید تا کاملا محکم شود (این کار باعث می\u200Cشود که کوفته از هر نوعی که باشد، هنگام طبخ از هم باز نشود) \n" +
                "برای تهیه کوفته در اندازه بزرگ\u200Cتر می\u200Cتوانید از یک کاسه در سایز مورد نظر، کمک بگیرید. به این ترتیب که کف کاسه را کمی مرطوب کنید و نیمی از مقدار مورد نظر از مایه کوفته را روی آن پهن کنید، مواد میانی را روی مایه پهن شده قرار دهید و نیمه دوم مایه را روی مواد بگذارید. کف یک دست را روی مواد قرار دهید و با دست دیگر کاسه را برگردانید. مایه کوفته به راحتی کف دست شما قرار می\u200Cگیرد. بعد هر دو قسمت مایه کوفته را روی هم محکم کنیدو کوفته را به صورت کروی در آورید. \n" +
                "تمام کوفته\u200Cها را به هر روشی که مایل بودید پر کنید. می\u200Cتوانید تعدای کوفته را در سایز کوچک\u200Cتر و بدون مواد میانی برای بچه\u200Cها، در نظر بگیرید. \n" +
                "درب قابلمه سس را بردارید و حرارت را کمی بالا ببرید تا سس کاملا بجوشد. بعد کوفته\u200Cها را با حداقل یک سانت فاصله از هم داخل سس در حال جوش قرار دهید و با قاشق مقداری از سس را روی کوفته\u200Cها بریزید. چند بار این کار را تکرار کنید تا مقداری از سس روی سطح کوفته\u200Cها بماند. \n" +
                "مقداری فلفل سیاه را روی کوفته\u200Cها بپاشید، درب قابلمه را بگذارید و حرارت زیر قابلمه را بسیار ملایم کنید.\n" +
                "تقریبا ۱ ساعت برای طبخ کامل کوفته\u200Cها زمان لازم است. طی این مدت چند بار به کوفته\u200Cها سر بزنید تا از اندازه بودن آب آن مطمئن شوید و نیز هر بار چند قاشق از سس کوفته روی کوفته\u200Cها بریزید تا علاوه بر خوشرنگ شدن روی کوفته\u200Cها، از خشک شدن آن\u200Cها نیز جلوگیری شود. بعد کوفته\u200Cها را در ظرف مناسب بچینید و همراه با نان سرو کنید. \n" +
                "نکته: \n" +
                "* وقتی قرار باشد کوفته به صورت مجلسی تهیه شود، معمولا تمام مواد را به صورت یک یا دو کوفته بزرگ در می\u200Cآورند و داخل کوفته\u200Cها را بسته به تعداد نفرات با تخم مرغ آب پز و سایر مواد پر می\u200Cکنند.\n" +
                "* برخی برای حصول اطمینان از باز نشدن کوفته، آن\u200Cها را جداگانه و محکم لای یک دستمال توری نازک و البته تمیز و بهداشتی قرار می\u200Cدهند و داخل سس می\u200Cگذارند. \n" +
                "* انواعی دیگر از کوفته تبریزی (با همین روش طبخ ولی اندکی تغییر در روش سرو) تهیه می\u200Cشود که به اسامی دیگری شهرت دارند. از جمله کوفته شاخدار یا کوفته مرغ (تویوخ کوفتسی) کوفته معلا (آرباب کوفتسی) و... \n" +
                "* دلیل اینکه چند بار تاکید شده است که کل مواد را بدون نمک آماده کنید این است که اندازه نمک از دستتان خارج نشود و کوفته بی\u200Cنمک یا شور نشود. بهتر است تمام مواد را بی\u200Cنمک آماده کنید و هنگام ورز دادن کوفته نمک را اضافه کنید. برای این مقدار مواد به طور متعادل ۲ قاشق غذا خوری نمک کافی است. (مقدار ذکر شده هم برای مایه کوفته است و هم برای سس کوفته) \n" +
                "* گوشتی که برای کوفته تبریزی استفاده می\u200Cکنید بهتر است مخلوطی از گوشت مغز ران گوسفند و فیله گوساله باشد. چربی و گرمی گوشت گوسفند و سردی و یکدستی گوشت گوساله باعث می\u200Cشود که کوفته هم خشک نشود و هم طعم بهتری داشته باشد. فقط دقت کنید که گوشت خیلی هم چرب نباشد. \n" +
                "* بهتر است نسبت تره و مرزه به حدی باشد که مزه تره غالب باشد یعنی حدود ۷۰٪ تره و ۳۰٪ مرزه. \n" +
                "* کوفته به خودی خود دیر هضم و سنگین است و ممکن است برای معده\u200Cهای حساس ایجاد ناراحتی کند، می\u200Cتوانید برای کم کردن سنگینی کوفته، برای افراد حساس و یا کودکان، تخم مرغ داخل آن را حذف کنید. \n" +
                "* به جای این مقدار گوجه فرنگی برای تهیه سس کوفته تبریزی، می\u200Cتوانید از ۳ قاشق غذاخوری رب گوجه فرنگی استفاده کنید. در این صورت مقدار نمک داخل کوفته را کمتر در نظر بگیرید و نمک داخل سس را کاملا حذف کنید. \n" +
                "چند دلیل رایج که باعث باز شدن (وا رفتن) کوفته می\u200Cشود: \n" +
                "* متعادل نبودن نسبت مواد اولیه، پختن کامل لپه، مقدار لپه بیش از حد، چرب بودن بیش از حد گوشت، درست ورز ندادن مایه کوفته، کم بودن مایع سس و پائین بودن دمای سس هنگامی که کوفته\u200Cها را به سس اضافه می\u200Cکنید. \n" +
                "فوت مهم کوفته\u200Cگری!\n" +
                "استفاده از یک عدد سیب زمینی باعث می\u200Cشود که احتمال وارفتن کوفته به حداقل برسد! توجه داشته باشید که سیب زمینی را حتما همراه لپه چرخ کنید. اگر سیب زمینی به تنهایی چرخ شود حالت کشدار پیدا می\u200Cکند که باعث به هم خوردن انسجام و چسبندگی مواد می\u200Cشود. \n" +
                "برای اینکه مواد براحتی از چرخ گوشت رد شوند و به دیواره\u200Cهای چرخ نچسبند نیز قبل از چرخ کردن آن\u200Cها کمی فلفل سیاه روی آن\u200Cها بپاشید\n";
        koftetabrizi.id = R.mipmap.koftetabrizi;
        koftetabrizi.k.add("گوشت");
        koftetabrizi.k.add("لپه");
        koftetabrizi.k.add("مرغ");
        koftetabrizi.k.add("برنج");
        koftetabrizi.k.add("سیب زمینی");
        koftetabrizi.k.add("پیاز");
        koftetabrizi.k.add("تخم مرغ");
        koftetabrizi.k.add("گردو");
        koftetabrizi.k.add("زعفران");
        kol.add(koftetabrizi);



        ghaza pizzamorghvagharch= new ghaza();
        pizzamorghvagharch.title ="پیتزا مرغ و قارچ";
        pizzamorghvagharch.desc="مواد لازم:\n" +
                " \n" +
                "•\tسینه مرغ نیم کیلو\n" +
                "•\tقارچ نیم کیلو\n" +
                "•\tفلفل دلمه متوسط دو عدد\n" +
                "•\tپیاز یک عدد\n" +
                "•\tسس گوجه فرنگی به مقدار لازم\n" +
                "•\tادویه کاری به مقدار لازم\n" +
                "•\tنمک و فلفل به میزان لازم\n" +
                "•\tطرز تهیه:\n" +
                "•\t \n" +
                "•\t1. قبل از اینکه شروع به پخت مواد پیتزا کنید باید خمیر را آماده کنید و بگذارید تا ور بیاید. بعد از آماده سازی خمیر، مرغ را به همراه پیاز و کمی زردچوبه بگذارید تا بپزد. مقداری که نیم پز شد نمک را هم اضافه کنید. بعد از اینکه پخت و کمی خنک شد، مرغ ها را ریش ریش کنید.\n" +
                "•\t \n" +
                "•\t2. قارچ ها و فلفل دلمه ها را هم به اندازه ها و شکل های دلخواه خرد کنید. مقدار کمی روغن در تابه بریزید و قارچ ها را بریزید تا کمی تفت بخورد. آب که انداخت و سبک شد، فلفل دلمه و مرغ ها را اضافه کنید و ادویه کاری و نمک و فلفل را نیز بریزید و کمی که تفت خورد، از روی حرارت بردارید. به این نکته توجه داشته باشید که قارچ بهتر است زیاد تفت نخورد و در واقع سرخ نشود، چرا که خواص و طعم عالیش از دست می رود.\n" +
                "•\t \n" +
                "•\t3. خمیر پیتزا را به اندازه مناسب و طوری که قطرش بیشتر از دو سانتی متر نشود، پهن کنید. سس را رویش بمالید و بعد، موادی را که آماده کرده اید، روی خمیر پهن کنید و پنیر پیتزا را رویش بریزید. در مرحله بعد، اگر دوست داشتید می توانید مقداری سس هم رویش اضافه کنید و در فر قرار دهید و در دمای ۲۲۰ درجه سانتیگراد به مدت نیم ساعت بگذارید تا بپزد. وقتی که خمیر کمی پخت، پنیر را اضافه کنید تا یک ربع دیگر پیتزا کاملا آماده سرو شود.\n" +
                "•\t \n" +
                "•\tفوت و فن عالی شدن پیتزا\n" +
                "•\t \n" +
                "•\tبرای اینکه پیتزای خیلی خوبی داشته باشید و خمیر کاملا بپزد و پنیرهای رویش نسوزد، همان طور که در بالا اشاره کردیم بهتر است که اول خمیر را به همراه مواد رویش در فر قرار دهید. وقتی که خمیرش پخت، پنیرها را اضافه کنید و بگذارید به مدت ده دقیقه تا یک ربع آماده شود.\n";
        pizzamorghvagharch.id = R.mipmap.pizzamorghvagharch;
        pizzamorghvagharch.k.add("مرغ");
        pizzamorghvagharch.k.add("قارچ");
        pizzamorghvagharch.k.add("پیاز");


        kol.add(pizzamorghvagharch);




        ghaza kababbarg= new ghaza();
        kababbarg.title ="کباب برگ";
        kababbarg.desc="مواد لازم :\n" +
                "گوشت راسته پاك كرده : یك كیلو و نیم\n" +
                "پیاز : دو سه عدد\n" +
                "روغن زیتون : یك استكان\n" +
                "فلفل بو نمك : به مقدار كم\n" +
                "طرز تهیه :\n" +
                "كباب برگ را می توانیم به هر اندازه كه میل داریم پهن كنیم، به این ترتیب كه راسته را روی تخته می گذاریم به اندازه ای كه میل داریم پهنای كباب بشود یك قطعه جدا می كنیم مثلا پهنا چهار انگشت و آن قطعه را پهلوی قطعات دیگر گوشت می گذاریم  وقطعات دیگر را می بریم ( با این عمل پهنای تمام گوشتها به یك اندازه می شود ) بعد گوشت را به قطر نیم سانتیمتر ورقه ورقه می كنیم و آماده می گذاریم.\n" +
                "پیاز را نرم رنده می كنیم و روغن زیتون و فلفل را با پیاز رنده شده مخلوط می كنیم و گوشت را در این مایه می خوابانیم و می گذاریم یك شب بماند.\n" +
                " بعد از ۲۴ ساعت گوشت ها را به سیخ كشیده و كمی روی آن را با كارد می كوبیم و روی حرارت ملایم كباب می كنیم و گاهی سیخهای كباب را بر می گردانیم كباب باید در عین پختگی زیاد خشك نشود و آبدار باشد .\n" +
                "كبابها را در دیس می كشیم و روی آنها را كمی نمك می پاشیم و كمی هم كره روی آن می گذاریم و اطراف آن را با پیاز خلال كرده و جعفری تزیین می كنیم .\n" +
                "كباب برگ را نباید هیچ وقت لای نان قرار داد زیرا آب كباب به خورد نان می رود و خشك می شود. در صورتی كه بخواهیم از گردهای نرم كننده مخصوص گوشت استفاده كنیم برای هر كیلو گوشت یك قاشق مربا خوری از گرد نرم كننده را با پیاز رنده شده مخلوط می كنیم و نیم ساعت قبل از كباب كردن گوشت را در این مایه می خوابانیم. می شود بدون روغن زیتون هم گوشت كباب را آماده كرد و در مایه از یك قاشق چایخوری زعفران سائیده استفاده نمود.\n" +
                "كباب برگ را با چلو و گوجه فرنگی كباب شده سرو می كنند .\n";
        kababbarg.id = R.mipmap.kababbarg;
        kababbarg.k.add("گوشت");
        kababbarg.k.add("پیاز");


        kol.add(kababbarg);






        ghaza khoraklobiyachitivanokhod= new ghaza();
        khoraklobiyachitivanokhod.title ="خوراک لوبیا چیتی و نخود";
        khoraklobiyachitivanokhod.desc="مواد لازم\n" +
                "\n" +
                "•    ۱ پیمانه لوبیا چیتی و نخود\n" +
                "\n" +
                "•    ۱ عدد سیب زمینی متوسط\n" +
                "\n" +
                "•    ۱ عدد گوجه فرنگی متوسط\n" +
                "\n" +
                "•    فلفل دلمه ای قرمز\n" +
                "\n" +
                "•    ۱ عدد پیاز  متوسط\n" +
                "\n" +
                "•    ۲ قاشق چایخوری زیره   \n" +
                "\n" +
                "•    ۲ حبه سیر  \n" +
                "\n" +
                "•    فلفل سیاه و نمک\n" +
                "\n" +
                "•    ۱ قاشق غذا خوری آب لیموی تازه \n" +
                "\n" +
                "\n" +
                "طرز تهیه\n" +
                "    نخود و لوبیا را از 4 یا 5 ساعت قبل خیس کنید. سپس با آب روی شعله متوسط بپزید تا کاملا پخته شوند. \n" +
                "\n" +
                "    سیب\u200Cزمینی ها را مکعبی خرد و به نخود و لوبیا اضافه کنید. \n" +
                "\n" +
                "    پیازها را ریز کنید. در روغن روی حرارت ملایم تفت دهید تا سبک شوند. سپس سیر را اضافه کنید و تفت دهید تا طلایی شوند. \n" +
                "\n" +
                "    گوجه\u200Cفرنگی ها را پوست بگیرید، خرد و به مواد اضافه کنید. فلفل دلمه ای ریز شده را بیفزایید. اگر مخلوط به غلظت مورد نظر نرسید، آرد را در آب حل کنید و به خوراک اضافه کنید تا کمی غلیظ شود. \n" +
                "\n" +
                "    در صورت نیاز نمک و فلفل سیاه بیفزایید. برای مزه\u200Cدار شدن، آب لیموی تازه و زیره بیفزایید و گرم سرو کنید.\n";
        khoraklobiyachitivanokhod.id = R.mipmap.khoraklobiyachitivanokhod;
        khoraklobiyachitivanokhod.k.add("لوبیا");
        khoraklobiyachitivanokhod.k.add("نخود");
        khoraklobiyachitivanokhod.k.add("سیب زمینی");
        khoraklobiyachitivanokhod.k.add("پیاز");
        khoraklobiyachitivanokhod.k.add("سیر");
        kol.add(khoraklobiyachitivanokhod);




        ghaza khorakmorghbalobiya= new ghaza();
        khorakmorghbalobiya.title ="خوراک مرغ با لوبیای سویا";
        khorakmorghbalobiya.desc="مواد لازم\n" +
                "\n" +
                "•    ۲ تکه کوچک مرغ   \n" +
                "\n" +
                "•    ۵۰ گرم لوبیای سویا خشک    \n" +
                "\n" +
                "•    نصف یک عدد فلفل دلمه ای متوسط\n" +
                "\n" +
                "•    ۱ عدد پیاز کوچک\n" +
                "\n" +
                "•    ۲ قاشق مرباخوری آب نارنج  یا آب لیمو   \n" +
                "\n" +
                "•    نمک، فلفل سیاه، زردچوبه و کمی پودر سیر\n" +
                "\n" +
                "\n" +
                "طرز تهیه\n" +
                "\n" +
                "لوبیای سویا را یک شب تا صبح خیس کنید. \n" +
                "\n" +
                "مرغ، لوبیای سویا، ۲ لیوان آب، پیاز درسته و زردچوبه را در یک قابلمه بریزید و روی حرارت ملایم پخته شوند. کمی هم نمک اضافه کنید. پس از پخته شدن مرغ آنها را در تابه روی حرارت ملایم تفت دهید تا طلایی شوند. \n" +
                "\n" +
                "پیاز را بیرون بیاورید و با چنگال له کنید دوباره درون قابلمه بریزید تا لوبیا سویا کاملا پخته شود. در مراحل پایانی پخت، نمک، آب نارنج و کمی پودر سیر اضافه کنید. \n" +
                "\n" +
                "فلفل دلمه ای خرد شده را بیفزایید و 5 دقیقه بعد از روی حرارت بردارید و به همراه مرغ سرو کنید.\n";
        khorakmorghbalobiya.id = R.mipmap.khorakmorghbalobiya;
        khorakmorghbalobiya.k.add("مرغ");
        khorakmorghbalobiya.k.add("لوبیا");
        khorakmorghbalobiya.k.add("پیاز");


        kol.add(khorakmorghbalobiya);




        ghaza khoraklobiyasefid= new ghaza();
        khoraklobiyasefid.title ="خوراک لوبیا سفید";
        khoraklobiyasefid.desc = "مواد لازم برای 2 نفر\n" +
                "\n" +
                " 2 قاشق غذاخوری روغن زیتون                              \n" +
                "\n" +
                " 75 گرم لوبیا سفید                               \n" +
                "\n" +
                "    نصف یک عدد پیاز کوچک                                          \n" +
                "\n" +
                "    برگ بو\n" +
                "\n" +
                "    یک پیمانه گوجه فرنگی خرد شده             \n" +
                "\n" +
                "    یک قاشق چای\u200Cخوری رب گوجه\u200Cفرنگی                       \n" +
                "\n" +
                "    نمک و فلفل سیاه     \n" +
                "\n" +
                "    یک قاشق چای\u200Cخوری شوید خشک شده                  \n" +
                "\n" +
                "\n" +
                "طرز تهیه\n" +
                "\n" +
                "    لوبیا را از 6 ساعت قبل درون یک ظرف بریزید، روی آن به مقداری آب بریزید تا روی لوبیاها را بگیرد و بعد از 6 ساعت آبکشی کنید.\n" +
                "\n" +
                "سپس آن\u200Cها را داخل یک قابلمه بریزید. به قدری آب اضافه کنید که سطح لوبیا را بپوشاند. آن را روی حرارت بگذارید تا جوش بیاید. \n" +
                "\n" +
                "    سپس حرارت را کم کنید، درب ظرف را بگذارید تا 30 دقیقه بپزد.\n" +
                "\n" +
                "    فر را با دمای 375 درجه فارنهایت روشن کنید.\n" +
                "\n" +
                "    در مدتی که لوبیا در حال پخت است، یک قاشق غذاخوری روغن در تابه بریزید تا داغ شود. سپس پیازها را درون آن سرخ کنید تا طلایی شود. آن را از روی حرارت بردارید.\n" +
                "\n" +
                "    پس از 30 دقیقه لوبیاها را آبکشی و به پیازها اضافه کنید. حالا بقیه روغن را درون قابلمه بریزید. گوجه، برگ بو و سه\u200Cچهارم پیمانه آب داخل ظرف بریزید و به هم بزنید و بگذارید تا آب جوش بیاید سپس از روی گاز بردارید و داخل فر بگذارید. \n" +
                "\n" +
                "    در طی یک ساعتی که غذای درون فر است، گاهی آن را هم بزنید و اگر لازم بود به آن آب اضافه کنید. رب گوجه را به آن اضافه و نمک و فلفل آن را اندازه کنید، صبر کنید تا لوبیاها نرم و کاملا پخته شود. آن را از فر بیرون بیاورید.\n" +
                "\n" +
                "    شوید را اضافه و خوب مخلوط کنید. درب آن را بگذارید و اجازه دهید 15 دقیقه بماند. ادویه آن را تنظیم کنید و با سلیقه خود تزئین و سرو کنید.\n";
        khoraklobiyasefid.id = R.mipmap.khoraklobiyasefid;
        khoraklobiyasefid.k.add("لوبیا");
        khoraklobiyasefid.k.add("پیاز");
        kol.add(khoraklobiyasefid);


        ghaza pizzapirashki= new ghaza();
        pizzapirashki.title ="پیتزا پیراشکی";
        pizzapirashki.desc = "مواد لازم:\n" +
                "\n" +
                " آرد      3 پیمانه\n" +
                " آب ولرم      1 پیمانه\n" +
                " مخمر      1 قاشق سوپخوری\n" +
                " شکر      1 قاشق سوپخوری\n" +
                " روغن مایع      4/1 پیمانه\n" +
                "\n" +
                "مواد لازم داخل پیراشکی :\n" +
                "\n" +
                "سوسیس      200 گرم\n" +
                "ژامبون      200 گرم\n" +
                "پنیر پیتزا      250 گرم\n" +
                "فلفل دلمه ای      1 عدد\n" +
                "قارچ      150 گرم\n" +
                "کره      1 قاشق سوپخوری\n" +
                "آویشن      2/1 قاشق چایخوری\n" +
                " روغن به میزان لازم\n" +
                "\n" +
                "\n" +
                "ابتدا آرد را در ظرف گودی ریخته و وسط آن را خالی کرده و مخمر و شکر را همراه روغن به آرد اضافه کرده و آب ولرم را کم کم می افزاییم و پس از مخلوط کردن خمیر به مدت 30 دقیقه همراه درپوش حوله ای به آن در جای گرم استراحت می دهیم .مواد درون پیراشکی را همه با هم مخلوط کرده و به اندازه 3 قاشق از این مخلوط در وسط خمیری که با وردنه به قطر دایره 15 سانتی در آورده ایم قرار می دهیم و لبه های خمیر را با کمی آب مرطوب کرده و به هم می چسبانیم سپس لبه های خمیر را همانند قطاب فرم داده و در روغن غوطه ور سرخ می کنیم ( با حرارت ملایم تا مغز پخت شود\n";
        pizzapirashki.id = R.mipmap.pizzapirashki;
        pizzapirashki.k.add("قارچ");
        pizzapirashki.k.add("سوسیس");
        kol.add(pizzapirashki);




        ghaza soopsabzijat= new ghaza();
        soopsabzijat.title ="سوپ سبزیجات";
        soopsabzijat.desc = "مواد لازم برای ۴ نفر:\n" +
                "\n" +
                "    سه چهارم پیمانه از بادام هندی خام\n" +
                "    دو قاشق غذاخوری روغن نارگیل\n" +
                "    یک عدد پیاز بزرگ خرد شده\n" +
                "    دو حبه سیر خرد شده\n" +
                "    پنج پیمانه کلم برکلی، گل کلم یا گوجه فرنگی خرد شده\n" +
                "    سه الی چهار پیمانه آب\n" +
                "    دو الی سه قاشق چایخوری نمک\n" +
                "    یک دوم قاشق چایخوری فلفل سیاه\n" +
                "\n" +
                "طرز تهیه:\n" +
                "\n" +
                "ابتدا بادام هندی را در یک کاسه از آب قرار دهید و اجازه دهید ۲۰ دقیقه در همین حالت باقی بماند. سپس آن را بشویید و خرد کنید. در یک ظرف بزرگ، روغن را روی حرارات متوسط گرم کنید. پیاز و سیر را در این ظرف حرارت دهید تا نرم شود. اینکار ممکن است ۵ دقیقه زمان نیاز داشته باشد. سبزیجات مورد علاقه خود را به این ترکیب اضافه کنید و سپس آب مورد نیاز را به آن بیفزایید. مقدار آب باید به گونه\u200Cای باشد که روی سبزیجات را بپوشاند. سپس نمک و فلفل را به آن اضافه کنید. به مدت ۸ الی ۱۰ دقیقه اجازه دهید روی حرارت بپزد تا سبزیجات نرم شود. مواد را بعد از خنک شدن به مخلوط کن یا میکسر انتقال دهید و خوب هم بزنید. بادام هندی را اضافه کنید و دوباره هم بزنید. طعم آن را بچشید و اگر نیاز بود باز هم نمک یا فلفل اضافه کنید.";
        soopsabzijat.id = R.mipmap.soopsabzijat;
        soopsabzijat.k.add("سیر");
        soopsabzijat.k.add("پیاز");

        kol.add(soopsabzijat);






        ghaza soopgharchkalampich= new ghaza();
        soopgharchkalampich.title ="سوپ قارچ و کلم پیچ";
        soopgharchkalampich.desc = "مواد لازم:\n" +
                "برای داشی مایع سوپ\n" +
                "•\tهشت پیمانه آب\n" +
                "•\t2 نوار کونبوجلبک دریایی\n" +
                "•\t3 عدد قارچ خشک شده\n" +
                "•\tزنجبیل تازه\u200Cی خرد شده\n" +
                "برای سوپ میسو:\n" +
                "•\tیک پیمانه از مایع سوپ داشی\n" +
                "•\tنصف پیمانه برنج قهوه\u200Cای\n" +
                "•\t226 گرم رشته فرنگی یا نودل\n" +
                "•\tدو حبه سیر خرد شده\n" +
                "•\t14 گرم قارچ\n" +
                "•\t6 الی 8 برگ کلم پیچ خرد شده\n" +
                "•\tزنجبیل تازه خرد شده\n" +
                "•\t198 گرم توفوی (پنیر لوبیا) خرد شده\n" +
                "•\t3 الی 4 عدد پیاز تازه\u200Cی خرد شده\n" +
                "طرز تهیه:\n" +
                "1.برای تهیه\u200Cی داشی( مایع سوپ) : ابتدا یک ظرف بزرگ را با آب پر کنید و کونبو، قارچ خشک شده و زنجبیل را به آن بیفزایید.حرارت متوسط را روشن کنید و اجازه دهید این مواد قبل از جوشیدن آب، کمی بپزد. حرارت را خاموش کنید و کونبوها، زنجبیل و قارچ\u200Cها را خارج کنید.\n" +
                "2.برای سوپ میسو : در حالیکه داشی هنوز گرم است، یک پیمانه از آن را برارید.\n" +
                "3.در یک ظرف جداگانه، نودل و یا رشته فرنگی را بر اساس دستور تهیه، آماده نمایید .\n" +
                "4.داشی را روی حرارت متوسط کمی گرم کنید و سپس سیر، کلم پیچ، قارچ، زنجبیل و توفو را به آن بیفزایید . سپس اجازه دهید کلم\u200Cها نرم شود . برای اینکار تقریبا 5 الی 10 دقیقه زمان نیاز است.\n" +
                "5.نودل\u200Cها را در یک کاسه قرار دهید و سوپ میسو را روی آن بریزید. شما می\u200Cتوانید پیاز را روی آن سرو کنید.\n";
        soopgharchkalampich.id = R.mipmap.soopgharchkalampich;
        soopgharchkalampich.k.add("قارچ");
        soopgharchkalampich.k.add("برنج");
        soopgharchkalampich.k.add("سیر");
        soopgharchkalampich.k.add("پیاز");

        kol.add(soopgharchkalampich);





        ghaza soopbasasa= new ghaza();
        soopbasasa.title ="سوپ با سالسای آووکادو";
        soopbasasa.desc = "مواد لازم:\n" +
                "•\t1 و ½ پیمانه دانه\u200Cی ذرت\n" +
                "•\t½ هویج\n" +
                "•\t½ ساقه کرفس\n" +
                "•\tآب لیمو (تقریبا دو قاشق چایخوری)\n" +
                "•\t½ پیاز\n" +
                "•\t¼ قاشق چایخوری نمک\n" +
                "•\t½ – ¾ پیمانه آب\n" +
                "•\t½ آووکادو خرد شده\n" +
                "•\t½ گوجه فرنگی خرد شده\n" +
                "•\tبرگ گشنزی مقداری (خرد شده)\n" +
                "دستور تهیه:\n" +
                "تمامی مواد به جز آووکادو ، گوجه فرنگی و گشنیز را با هم ترکیب کنید و در یک میکسر بریزید . آن را مخلوط کنید تا ترکیب یکدستی حاصل شود.\n" +
                "برای ایجاد سالسا ، کافیست آووکادو ، گوجه فرنگی و گشنیز را در یک کاسه\u200Cی کوچک ترکیب کنید .\n" +
                "سوپ را در ظرف مناسب بریزید و با سالسای آماده شده سرو کنید \n";
        soopbasasa.id = R.mipmap.soopbasasa;
        soopbasasa.k.add("ذرت");
        soopbasasa.k.add("پیاز");
        soopbasasa.k.add("کرفس");
        kol.add(soopbasasa);



        ghaza soopsabzijatfasli= new ghaza();
        soopsabzijatfasli.title ="سوپ غلیظ سبزیجات فصلی";
        soopsabzijatfasli.desc = "مواد لازم :\n" +
                "•\t1 قاشق غذاخوری روغن زیتون\n" +
                "•\t1 عدد پیاز خرد شده\n" +
                "•\t2 عدد هویج خرد شده\n" +
                "•\t2 ساقه کرفس بزرگ خرد شده\n" +
                "•\t4 حبه سیر له شده\n" +
                "•\t1 قاشق چایخوری آویشن خشک\n" +
                "•\t2 قوطی گوجه فرنگی خرد شده (هر کدام از قوطی\u200Cها باید 396 گرم باشد)\n" +
                "•\t2 و ½ پیمانه از آب سبزیجات\n" +
                "•\t1 قاشق چایخوری نمک دریایی\n" +
                "•\t1 قاشق چایخوری فلفل سیاه\n" +
                "•\t½ پیمانه ماکارونی شکل دار\n" +
                "•\t1 عدد برگ بو\n" +
                "•\t1 قوطی لوبیای سفید پخته شده\n" +
                "دستور تهیه :\n" +
                "ابتدا ظرفی را روی حرارات ملایم قرار دهید ، کمی روغن زیتون به آن اضافه کنید و سپس پیازها، هویج، سیر ،آویشن و کرفس را اضافه کنید . این مواد را به مدت 8 الی 10 دقیقه بپزید تا نرم شود.\n" +
                "گوجه فرنگی\u200Cها ، آب سبزیجات ، برگ بو ، نمک، و فلفل را به ظرف اضافه کنید . این مواد را هم بزنید.\n" +
                "حرارت را کم کنید و پخت را تا 20 دقیقه ادامه دهید.\n" +
                "پاستاها را اضافه کنید و به مدت 10 دقیقه بپزید.\n" +
                "برگ بو را از ظرف خارج کنید و لوبیاها را به آن اضافه کنید . پخت را به مدت 2 الی 3 دقیقه ادامه دهید . کمی به هم بزنید تا لوبیاها نیز گرم شود.\n";
        soopsabzijatfasli.id = R.mipmap.soopsabzijatfasli;
        soopsabzijatfasli.k.add("کرفس");
        soopsabzijatfasli.k.add("پیاز");
        soopsabzijatfasli.k.add("سیر");

        soopsabzijatfasli.k.add("ماکارونی");

        kol.add(soopsabzijatfasli);










        ghaza soopmorghvareshtefarangi= new ghaza();
        soopmorghvareshtefarangi.title ="سوپ مرغ و رشته فرنگی";
        soopmorghvareshtefarangi.desc = "مواد لازم :\n" +
                "•\t6 فنجان آب مرغ غلیظ شده\n" +
                "•\tیک قاشق چای خوری پودر پیاز\n" +
                "•\tنصف قاشق چای خوری برگ ریحان خشک شده ، خرد شده\n" +
                "•\tیک چهارم قاشق چای خوری پودر سیر\n" +
                "•\t270 گرم سبزیجات مخلوط یخ زده\n" +
                "•\tیک فنجان رشته فرنگی متوسط\n" +
                "طرز تهیه :\n" +
                "پودر پیاز، ریحان، پودر سیر و سبزیجات و آب مرغ را در یک ماهیتابه سه لیتری ریخته و مخلوط می\u200Cکنیم و روی حرارت قرار می\u200Cدهیم تا بجوش آید.\n" +
                "سپس رشته فرنگی را اضافه کرده و به مدت 5 دقیقه هم می\u200Cزنیم.\n" +
                "این غذا بسیار سریع و آسان پخت می\u200Cشود و می\u200Cتوان در عرض کمتر از 25 دقیقه یک سوپ خوشمزه داشته باشید.\n";
        soopmorghvareshtefarangi.id = R.mipmap.soopmorghvareshtefarangi;
        soopmorghvareshtefarangi.k.add("سیر");
        soopmorghvareshtefarangi.k.add("پیاز");
        kol.add(soopmorghvareshtefarangi);









        ghaza soopboghalamon= new ghaza();
        soopboghalamon.title ="سوپ بوقلمون";
        soopboghalamon.desc = "مواد لازم :\n" +
                "•\t5 لیتر آب\n" +
                "•\tیک بوقلمون\n" +
                "•\tیک و نیم فنجان پیاز درشت خرد شده\n" +
                "•\tسه ساقه کرفس\n" +
                "•\tنصف فنجان هویج خرد شده\n" +
                "•\t10 عدد فلفل کامل\n" +
                "•\tیک قاشق چای خوری آویشن خشک\n" +
                "•\t600 گرم هویج ، خرد شده\n" +
                "•\tدو عدد پیاز ، تکه شده\n" +
                "•\tشش ساقه کرفس ، خرد شده\n" +
                "•\tیک فنجان جو پرک\n" +
                "•\tنصف فنجان خرد شده قارچ\n" +
                "•\tدو قاشق چای خوری نمک\n" +
                "•\tیک قاشق چای خوری مرزنجوش خشک شده\n" +
                "•\tنصف قاشق چای خوری فلفل سیاه\n" +
                "طرز تهیه :\n" +
                "ابتدا یک قابلمه آب می\u200Cآوریم و بوقلمون را درونش می\u200Cگذاریم و حرارت می\u200Cدهیم تا بجوش آید سپس یک و نیم فنجان پیاز خرد شده ، سه ساقه کرفس ، نصف فنجان هویج خرد شده و فلفل را درونش ریخته و اجازه می\u200Cدهیم دو تا دو و نیم ساعت بجوشد و اگر آبش تبخیر شد به آن آب اضافه می\u200Cکنیم سپس اجازه می\u200Cدهیم کمی خنک شود و گوشت بوقلمون را درون یخچال قرار می\u200Cدهیم و آبش را درون ظرف نگه می\u200Cداریم.\n" +
                "حال 600 گرم هویج ، 2 پیاز ، 6 ساقه کرفس ، جو ، قارچ ، نمک ، مرزنجوش ، فلفل سیاه و آویشن را درون آب بوقلمون مخلوط می\u200Cکنیم و درون قابلمه ریخته و روی حرارت قرار می\u200Cدهیم تا بجوش آید و حدود 1 ساعت و 20 دقیقه اجازه می\u200Cدهیم تا سوپ جا بیافتد.\n" +
                "این سوپ خوشمزه را سرو کنید و البته تکه\u200Cهای گوشت بوقلمون را هم به آن اضافه کنید.\n";
        soopboghalamon.id = R.mipmap.soopboghalamon;
        soopboghalamon.k.add("بوقلمون");
        soopboghalamon.k.add("پیاز");
        soopboghalamon.k.add("کرفس");
        soopboghalamon.k.add("قارچ");
        kol.add(soopboghalamon);




        ghaza sooparositaliyaei= new ghaza();
        sooparositaliyaei.title ="سوپ عروس ایتالیایی";
        sooparositaliyaei.desc = "مواد لازم :\n" +
                "•\t250 گرم گوشت گاو بدون چربی\n" +
                "•\tیک عدد تخم مرغ\n" +
                "•\tدو قاشق غذا خوری خرده نان خشک\n" +
                "•\tیک قاشق غذا خوری پنیر پارمسان رنده شده\n" +
                "•\tنصف قاشق چای خوری ریحان خشک شده\n" +
                "•\tنصف قاشق چای خوری پودر پیاز\n" +
                "•\tپنج و سه چهارم فنجان سوپ مرغ آب گوشت\n" +
                "•\tیک فنجان ماکارونی\n" +
                "•\tیک سوم فنجان هویج ریز خرد شده\n" +
                "طرز تهیه :\n" +
                "گوشت، تخم مرغ، خرده نان، پنیر، ریحان و پودر پیاز را درون یک کاسه متوسط می\u200Cریزیم و با هم ترکیب می\u200Cکنیم .\n" +
                "سپس یک ماهیتابه بزرگ را روی حرارت قرار می\u200Cدهیم و آب گوشت را ریخته و ماکارونی و هویج را اضافه کرده و اجازه می\u200Cدهیم تا به جوش آید و سپس به مدت 10 دقیقه می\u200Cگذاریم تا آرام غل بزند در همین حین هم می\u200Cزنیم تا به هم نچسبند.\n" +
                "سوپ شما آماده است و می\u200Cتوانید از مزه لذیذ آن لذت ببرید.\n";
        sooparositaliyaei.id = R.mipmap.sooparositaliyaei;
        sooparositaliyaei.k.add("گوشت");
        sooparositaliyaei.k.add("تخم مرغ");
        sooparositaliyaei.k.add("پیاز");
        sooparositaliyaei.k.add("ماکارونی");
        kol.add(sooparositaliyaei);




        ghaza soopgharch= new ghaza();
        soopgharch.title ="سوپ قارچ";
        soopgharch.desc = "مواد لازم :\n" +
                "•\tنصف پیاز کوچک خرد شده\n" +
                "•\t3 حبه سیر\n" +
                "•\t1 فنجان قارچ خرد شده\n" +
                "•\t0.5 فنجان کرفس خرد شده\n" +
                "•\t2 قاشق سوپخوری کره\n" +
                "•\t1 فنجان شیر\n" +
                "•\t4 قاشق سوپخوری شیر خشک\n" +
                "•\t2 قاشق سوپخوری آرد\n" +
                "•\t0.5 قاشق چایخوری نمک\n" +
                "•\tمقداری فلفل\n" +
                "طرز تهیه :\n" +
                "سیر ویک چهارم پیاز خرد شده را همراه یک لیوان آب سرد داخل مخلوط کن و اجازه می دهیم مواد خوب با هم ترکیب شوند.بعد آب آن را از صافی عبور می دهیم.\n" +
                "در داخل یک ظرف 1 قاشق سوپخوری روغن زیتون یا کره می ریزیم و قارچ و پیاز و کرفس را داخل آن سرخ می کنیم.\n" +
                "بقیه مواد را داخل مخلوط کن ریخته و آنها را کامل با هم مخلوط می کنیمسیر وپیازی را که قبلا حاضر کردیم را به آنها اضافه می کنیم.\n" +
                "سپس مواد سرخ شده را نیز به آنها اضافه کرده وبه مدت 10 ثانیه در داخل مخلوط کن با هم مخلوط می کنیم.\n" +
                "همه مواد را داخل ماهی تابه ریخته و آنها را روی حرارت ملایم می پزیم. برای داشتن سوپی غلیظ می توانید 1 قاشق سوپخوری خامه به مواد اضافه کنید.\n" +
                "کره باقیمانده را می توانید قبل از سرو سوپ به آن اضافه کنید.\n";
        soopgharch.id = R.mipmap.soopgharch;
        soopgharch.k.add("سیر");
        soopgharch.k.add("پیاز");
        soopgharch.k.add("قارچ");
        soopgharch.k.add("کرفس");

        kol.add(soopgharch);






        ghaza soopsadeyechini= new ghaza();
        soopsadeyechini.title ="سوپ ساده چینی";
        soopsadeyechini.desc = "مواد لازم: \u200F\n" +
                "مخصوص ۴ نفر \u200F\n" +
                "•\t\u200F۱ قوطی( ۴۸۰ گرم) ذرت شیری\n" +
                "•\t\u200F۱ قوطی( ۴۵۰ گرم) عصاره\u200Cی مرغ، کم سدیم \u200F\n" +
                "•\t\u200F۱ عدد تخم\u200Cمرغ زده شده \u200F\n" +
                "•\t۱ قاشق سوپ\u200Cخوری نشاسته\u200Cی ذرت \u200F\n" +
                "•\t\u200F۲ قاشق سوپ\u200Cخوری آب \u200F\n" +
                "آماده سازی مواد: ۵ دقیقه \u200F\n" +
                "زمان پخت: ۱۰ دقیقه \u200F\n" +
                "مجموع زمان: ۱۵ دقیقه \u200F\n" +
                "طرز تهیه: \u200F\n" +
                "1.\tدر قابلمه\u200Cای، ذرت شیری و عصاره\u200Cی مرغ را مخلوط نمائید. قابلمه را روی حرارت ملایم قرار دهید تا بجوشد. در کاسه\u200Cای \u200Fکوچک یا یک فنجان، نشاسته\u200Cی ذرت را در آب حل کنید؛ سپس درون قابلمه\u200Cی سوپ ذرت بریزد و اجازه دهید به مدت ۲ دقیقه \u200Fبپزند یا مادامی که غلیظ شوند. به تدریج تخم\u200Cمرغ زده شده را در حالی که سوپ را هم می\u200Cزنید به قابلمه اضافه نمائید. از روی \u200Fحرارت بردارید و سرو کنید. \u200F\n";
        soopsadeyechini.id = R.mipmap.soopsadeyechini;
        soopsadeyechini.k.add("ذرت");
        soopsadeyechini.k.add("تخم مرغ");

        kol.add(soopsadeyechini);







        ghaza soopmorghvareshte= new ghaza();
        soopmorghvareshte.title ="سوپ مرغ و رشته";
        soopmorghvareshte.desc = "•\t6 فنجان آب مرغ\n" +
                "•\tران مرغ بدون پوست و استخوان\n" +
                "•\t1 فنجان کرفس خورد شده\n" +
                "•\t1 فنجان پیاز خرد شده\n" +
                "•\t1 فنجان هویج کوچک نصف شده\n" +
                "•\t1 عدد شقاقل ( هویج وحشی) خرد شده و پوست گرفته شده\n" +
                "•\t1 قاشق سوپخوری سیر خرد شده\n" +
                "•\t1 عدد برگبو خشک شده\n" +
                "•\t0.25 قاشق سوپخوری فلفل خشک شده\n" +
                "•\t2 فنجان رشته\n" +
                "•\t0.25 فنجان شوید تازه خشک شده\n" +
                "دستور پخت سوپ مرغ\n" +
                "آب مرغ، ران مرغ، کرفس، پیاز، هویج، سیر، فلفل، شقاقل و برگبو را داخل ماهیتابه بزرگی می\u200Cریزیم و در آن را می\u200Cبندیم تا به جوش بیاید. پایه اجاق را کم می\u200Cکنیم و می\u200Cگذاریم بمدت 25 دقیقه بپزد. مرغ و سبزیجات باید کاملا پخته شوند.\n" +
                "برگبو را از ماهیتابه خارج می\u200Cکنیم و دور می\u200Cاندازیم. مرغ را به ظرف دیگری منتقل می\u200Cکنیم تا به آرامی سرد شود. رشته را به سوپ اضافه می\u200Cکنیم و می گذاریم 10 دقیقه با مواد بجوشد.\n" +
                "در فاصله\u200Cای که رشته در حال پختن شدن با سوپ است، ران مرغ را با دست یا چنگال ریز ریز کرده، سپس آن را همراه با شوید به سوپ اضافه می\u200Cکنیم.\n";
        soopmorghvareshte.id = R.mipmap.soopmorghvareshte;
        soopmorghvareshte.k.add("مرغ");
        soopmorghvareshte.k.add("کرفس");
        soopmorghvareshte.k.add("پیاز");
        soopmorghvareshte.k.add("سیر");

        kol.add(soopmorghvareshte);






        ghaza soopkadotanbalkhameei= new ghaza();
        soopkadotanbalkhameei.title ="سوپ کدو تنبل خامه ای";
        soopkadotanbalkhameei.desc = "مواد لازم\n" +
                "•\t2 قاشق سوپخوری روغن زیتون\n" +
                "•\t1 عدد پیاز خرد شده\n" +
                "•\t2 حبه سیر خرد شده\n" +
                "•\t600 گرم کدو تنبل خرد شده\n" +
                "•\t1 عدد سیب زمینی خرد شده\n" +
                "•\t2 عدد هویج خرد شده\n" +
                "•\t1 عدد تره فرنگی خرد شده فقط قسمت سفید ان\n" +
                "•\tنصف قاشق سوپخوری جوز هندی\n" +
                "•\t3 فنجان آب مرغ\n" +
                "•\tنصف فنجان خامه\n" +
                "•\t1 قاشق سوپخوری تخم کدوی بو داده\n" +
                "•\tقره قاط خشک شده و جعفری به مقدار لازم\n" +
                "دستور پخت\n" +
                "مرحله 1: روغن را داخل یک ماهیتابه بزرگ ریخته و آن را بر روی حرارت ملایم می\u200Cگذاریم تا داغ شود. پیاز را به آن اضافه کرده و به مدت 2 الی 3 دقیقه آن را سرخ می\u200Cکنیم. سیر و سبزیجات و جوز هندی را به آن اضافه می\u200Cکنیم و می\u200Cگذاریم که خوب بپزد. سپس آب مرغ را به اضافه 2 فنجان آب به آن اضافه می\u200Cکنیم و می\u200Cگذاریم به جوش بیاید. دمای اجاق را کم می\u200Cکنیم و بعد درب ظرف را می\u200Cبندیم تا سوپمان بمدت 25 دقیقه بپزد. بعد آن را کنار می\u200Cگذاریم تا به آرامی سرد شود.\n" +
                "مرحله 2: همه مواد را درون مخلوط کن می\u200Cریزیم تا سوپمان کاملا صاف و یکدست شود. سپس دوباره آن را داخل ماهیتابه می\u200C ریزیم و آن را روی حرارت ملایم اجاق می\u200Cگذاریم. خامه را به آن اضافه کرده و کاملا به هم می\u200Cزنیم سپس ادویه\u200Cجات را به آن اضافه می\u200Cکنیم. در آخر می\u200Cتوانیم روی آن را با جعفری و تخم کدو و روغن زیتون بپوشانیم و آن را سرو کنیم.\n";
        soopkadotanbalkhameei.id = R.mipmap.soopkadotanbalkhameei;
        soopkadotanbalkhameei.k.add("پیاز");
        soopkadotanbalkhameei.k.add("سیر");
        soopkadotanbalkhameei.k.add("سیب زمینی");

        kol.add(soopkadotanbalkhameei);





        /*ghaza khoraklobiyasefid= new ghaza();
        khoraklobiyasefid.title ="";
        khoraklobiyasefid.desc = "";
        khoraklobiyasefid.id = R.mipmap.khoraklobiyasefid;
        khoraklobiyasefid.k.add("لوبیا");
        khoraklobiyasefid.k.add("پیاز");
        kol.add(khoraklobiyasefid);




///////////////////////////////////////////////////////////////////////////////////////////////////
    /*   ghaza a= new ghaza();
        a.id = R.mipmap.joojehkabab;
        a.title ="فسنجان";

        InputStream j = getResources().getAssets().open("texts/ghazaha.html");
       a.desc=convertInputStreamToString(j);
        a.k.add("گردو");
        a.k.add("مرغ");
        a.k.add("پیاز");
        a.k.add("رب انار");

         kol.add(a);*/


        /*    WebView id = (WebView) findViewById(R.id.id);

            try {
                InputStream j = getResources().getAssets().open("texts/ghazaha.html");
                String y = convertInputStreamToString(j);
                id.loadDataWithBaseURL("", y, "text/html", "UTF-8", "");
            }
            catch (IOException e) {
                e.printStackTrace();
            }*/




      //  } catch (Exception e) {
      //      e.printStackTrace();
      //  }

    }



   /* private static String convertInputStreamToString(InputStream inputStream) {
        try {
            BufferedReader reader = new BufferedReader(new InputStreamReader(inputStream));
            StringBuilder builder = new StringBuilder();

            String line = "";

            while ((line = reader.readLine()) != null) {
                builder.append(line);
            }

            return builder.toString();
        }
        catch (IOException e) {
            e.printStackTrace();
        }

        return null;
    }*/
}
